#Область ОбработчикиСобытийФормы

// Обработчик события формы ПриСозданииНаСервере
//
// Параметры:
//   Отказ - Булево - Признак отказа от создания формы
//   СтандартнаяОбработка - Булево - Признак выполнения стандартной обработки
//
&После("ПриСозданииНаСервере")
Процедура MRS_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализация интеграции с Диадок
	MRS_ИнтеграцияДиадокКлиентСервер.ДополнитьФормуИнтеграциейДиадок(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияДиадок

// Обработчик команды перехода в личный кабинет Диадок
//
// Параметры:
//   Команда - КомандаФормы - Выполняемая команда
//
&НаКлиенте
Процедура ДиадокПерейтиВЛичныйКабинет(Команда)
	
	Ссылка = Объект.Ссылка;
	
	MRS_ИнтеграцияДиадокКлиент.ПерейтиКДокументуДиадок(ЭтотОбъект, Ссылка);
	
КонецПроцедуры

// Обработчик команды получения статуса документа в Диадок
//
// Параметры:
//   Команда - КомандаФормы - Выполняемая команда
//
&НаКлиенте
Процедура ДиадокПолучитьСтатус(Команда)
	
	Ссылка = Объект.Ссылка;
	
	MRS_ИнтеграцияДиадокКлиент.ПолучитьСтатусДокументаДиадок(ЭтотОбъект, Ссылка);
	
КонецПроцедуры

#КонецОбласти
