//&После("ОбработкаПроведения")
//Процедура КГМ_ОбработкаПроведения(Отказ, РежимПроведения)   
//	
//	Сообщить("акцизы"); 
//	
//	Сообщить(дата);

//   	   // Добавим новую запись в регистр накопления МестоХраненияМатериалов.
//    НоваяЗапись = Движения.алкАкцизПоПриобретеннымЦенностям.Добавить();   
//	новаязапись.Активность=Истина;
//    НоваяЗапись.Организация = Организация;  
//	НоваяЗапись.ДоговорКонтрагента=Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию("01/06-2016 Д от 01.06.2016г."); 
//	НоваяЗапись.Период=Дата;
//	
//	//НоваяЗапись.МестоХранения = Справочники.МестоХраненияы.НайтиПоНаименованию("Основной");
//	//НоваяЗапись.Материалы = Справочники.Материалы.НайтиПоНаименованию("Доска обрезная");
//	//НоваяЗапись.Период = ТекущаяДата();
//    НоваяЗапись.Количество = 3000;  
//	НоваяЗапись.СуммаАкциза=600;

//    Движения.алкАкцизПоПриобретеннымЦенностям.Записать(Истина); // удалим старые записи и запишем вместо них новые

//	
//КонецПроцедуры   

&После("ОбработкаПроведения")
Процедура КГМ_ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр КГМ_Прослеживаемость     
	
	//Если СокрЛП(Год(Дата))="2 021" Тогда 
	//	Коэф=0.031;  
	//Иначе 
		Коэф =0.032; 
	//КонецЕсли;
	
	Движения.алкАкцизПоПриобретеннымЦенностям.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл   
		
		//Если ТекСтрокаТовары.Номенклатура.алкТипПродукции=Перечисления.алкТипыАлкогольнойПродукции.Виноград Тогда
		
		Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры=Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Виноград") Тогда
			
			
		// Расход ====================================================================================================================
		Движение = Движения.алкАкцизПоПриобретеннымЦенностям.Добавить();  
		
		Движение.Активность=Истина;
		Движение.Период			= Дата; 
		Движение.Организация	= Организация; 
		Движение.ДоговорКонтрагента=Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Номер","1-Виноград");
		Движение.Сделка= ссылка;   
			
		// Измерения 
		Движение.СерияНоменклатуры	= ТекСтрокаТовары.Серия;    
		Движение.Номенклатура=ТекСтрокаТовары.Номенклатура;

		Движение.СостояниеСырья		= Перечисления.алкСостоянияПодакцизногоСырья.ВМестахХранения;
		Движение.СтатусАкциза		= Перечисления.алкСостоянияОплатыВходящегоАкциза.АкцизПоОплаченнымМЦ;
		
		Движение.Количество		= ТекСтрокаТовары.Количество;
		//Движение.Стоимость		= 0;
		Движение.СуммаАкциза	= Коэф*ТекСтрокаТовары.Количество;  
		Движение.КБК=Справочники.алкКодыБюджетнойКлассификации2005.НайтиПоКоду("18210302091011000110");
		Движение.СуммаПлатежа=ТекСтрокаТовары.Сумма;
		
		
		КонецЕсли;
		
		// Реквизиты
	КонецЦикла;
	
КонецПроцедуры



