
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение списка выбора для видов условий
	ЗаполнитьСписокВидовУсловий();
	
	// Заполнение списка выбора для операторов
	ЗаполнитьСписокОператоров();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВидовУсловий()
	
	СписокВидов = Элементы.УсловияВидУсловия.СписокВыбора;
	СписокВидов.Очистить();
	
	СписокВидов.Добавить("СтавкаНДС", "Ставка НДС");
	СписокВидов.Добавить("МернаяЕдиницаИзмерения", "Мерная единица измерения");
	СписокВидов.Добавить("СвободнаяЦена", "Свободная цена");
	СписокВидов.Добавить("ЕдиницаИзмерения", "Единица измерения");
	СписокВидов.Добавить("Номенклатура", "Номенклатура");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОператоров()
	
	СписокОператоров = Элементы.УсловияОператор.СписокВыбора;
	СписокОператоров.Очистить();
	
	СписокОператоров.Добавить("Равно");
	СписокОператоров.Добавить("НеРавно");
	СписокОператоров.Добавить("Больше");
	СписокОператоров.Добавить("БольшеИлиРавно");
	СписокОператоров.Добавить("Меньше");
	СписокОператоров.Добавить("МеньшеИлиРавно");
	СписокОператоров.Добавить("Содержит");
	СписокОператоров.Добавить("НеСодержит");
	СписокОператоров.Добавить("Заполнено");
	СписокОператоров.Добавить("НеЗаполнено");
	
КонецПроцедуры

#КонецОбласти
