
//ТелоЗапроса:
//MONTH - Месяц из формы обработк в БП
Функция ПолучитьТаблицуВГОPOST(Запрос)
	
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		
		JSON = Новый ЧтениеJSON;
		
		JSON.УстановитьСтроку(ТекстЗапроса);
		
		Данные = ПрочитатьJSON(JSON,, "Дата");
		
	Исключение
		
		Ответ = Новый HTTPСервисОтвет(500);
		
		Ответ.Заголовки.Вставить("Content-type", "application/json;charset=utf-8");
		
		Ответ.УстановитьТелоИзСтроки(ОписаниеОшибки());
		
		Возврат Ответ;
		
	КонецПопытки;
	
	//ОрганизацияИНН = Данные.ORG;
	Дата = Данные.MONTH;	
	
	//Получаем ТЗ из запроса, если несколько организаций, объеденим
	Результат = MRS_HTTPИнтеграция.ПолучитьТаблицуМежфирменных(Дата);
	
	Тело = ОбщегоНазначения.ЗначениеВСтрокуXML(Результат);
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.УстановитьТелоИзСтроки(Тело);
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	
	Возврат Ответ;
	
КонецФункции

//ТелоЗапроса:
//MONTH - Месяц из формы обработк в БП
Функция ПолучитьТаблицуКомплектацийPOST(Запрос)
	
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		
		JSON = Новый ЧтениеJSON;
		
		JSON.УстановитьСтроку(ТекстЗапроса);
		
		Данные = ПрочитатьJSON(JSON,, "Дата");
		
	Исключение
		
		Ответ = Новый HTTPСервисОтвет(500);
		
		Ответ.Заголовки.Вставить("Content-type", "application/json;charset=utf-8");
		
		Ответ.УстановитьТелоИзСтроки(ОписаниеОшибки());
		
		Возврат Ответ;
		
	КонецПопытки;
	
	//ОрганизацияИНН = Данные.ORG;
	Дата = Данные.MONTH;	
	
	//Получаем ТЗ из запроса, если несколько организаций, объеденим
	Результат = MRS_HTTPИнтеграция.ПолучитьТаблицуПересортицы(Дата);
	
	Тело = ОбщегоНазначения.ЗначениеВСтрокуXML(Результат);
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.УстановитьТелоИзСтроки(Тело);
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	
	Возврат Ответ;
	
КонецФункции

Функция ЗапуститьРегламентноеЗаданиеСверткиPOST(Запрос)
	
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		
		JSON = Новый ЧтениеJSON;
		
		JSON.УстановитьСтроку(ТекстЗапроса);
		
		Данные = ПрочитатьJSON(JSON,,"Дата");
		
	Исключение
		
		Ответ = Новый HTTPСервисОтвет(500);
		
		Ответ.Заголовки.Вставить("Content-type", "application/json;charset=utf-8");
		
		Ответ.УстановитьТелоИзСтроки(ОписаниеОшибки());
		
		Возврат Ответ;
		
	КонецПопытки;
	
	//ОрганизацияИНН = Данные.ORG;
	Дата = Данные.MONTH;	
	Принудительно = Данные.FORCE;
	
	//Получаем ТЗ из запроса, если несколько организаций, объеденим
	Результат = MRS_HTTPИнтеграция.ДобавитьРегламентноеЗаданиеНаСервере(Дата, Принудительно);
	
	Тело = Результат;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.УстановитьТелоИзСтроки(Тело);
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьСтатусЗаданийPOST(Запрос)
	
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		
		JSON = Новый ЧтениеJSON;
		
		JSON.УстановитьСтроку(ТекстЗапроса);
		
		Данные = ПрочитатьJSON(JSON,,"Дата");
		
	Исключение
		
		Ответ = Новый HTTPСервисОтвет(500);
		
		Ответ.Заголовки.Вставить("Content-type", "application/json;charset=utf-8");
		
		Ответ.УстановитьТелоИзСтроки(ОписаниеОшибки());
		
		Возврат Ответ;
		
	КонецПопытки;
	
	//ОрганизацияИНН = Данные.ORG;
	Дата = Данные.MONTH;	
	Тип = Данные.TYPE;
	
	//Получаем ТЗ из запроса, если несколько организаций, объеденим
	Результат = MRS_HTTPИнтеграция.ПолучитьСтатусыЗаданий(Дата, Тип);
	
	Тело = Результат;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.УстановитьТелоИзСтроки(Тело);
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	
	Возврат Ответ;

КонецФункции
