
&После("ОтразитьДвижения")
Процедура КГМ_ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ)
	//Переделаю и перезапишу таблицу проведения
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
		Возврат;	
	КонецЕсли;	
	
	Если
			ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) =  Тип("ДокументСсылка.алкОтчетОПроизводствеПродукцииЕГАИС")
		ИЛИ ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) =  Тип("ДокументСсылка.ТТНВходящаяЕГАИС")
		ИЛИ ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) =  Тип("ДокументСсылка.ТТНИсходящаяЕГАИС")
		ИЛИ ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) =  Тип("ДокументСсылка.АктСписанияЕГАИС")
		ИЛИ ТипЗнч(ДополнительныеСвойства.ДляПроведения.Ссылка) =  Тип("ДокументСсылка.АктПостановкиНаБалансЕГАИС")
		
		Тогда
	
		Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиАлкогольнойПродукцииЕГАИС;
		
		НовенькаяТаблица = Таблица.Скопировать();
		НовенькаяТаблица.Очистить();
		
		Для Каждого СтрокаИсходной Из Таблица Цикл
			
			Если СтрокаИсходной.СвободныйОстаток <> 0 Тогда
				
				НС = НовенькаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НС, СтрокаИсходной);
				
				НС = НовенькаяТаблица.Добавить();
				ЗаполнитьЗначенияСвойств(НС, СтрокаИсходной);
				НС.Количество = СтрокаИсходной.СвободныйОСтаток;
				НС.СвободныйОСтаток = 0;
				
			КонецЕсли;	
			
		КонецЦикла;
		
		
		ДвиженияОстаткиАлкогольнойПродукцииЕГАИС = Движения.ОстаткиАлкогольнойПродукцииЕГАИС;
		ДвиженияОстаткиАлкогольнойПродукцииЕГАИС.Записывать = Истина;
		ДвиженияОстаткиАлкогольнойПродукцииЕГАИС.Загрузить(НовенькаяТаблица);
		
		// Ну..... как-то так
	КонецЕсли;
	
	
КонецПроцедуры
