&После("ОбработкаПроверкиЗаполнения")
Процедура IT_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	IT_ПроверитьЗаполненЗаказ(Отказ);

	IT_ПроверитьЗаполненДоговор(Отказ);
	
КонецПроцедуры

Процедура IT_ПроверитьЗаполненЗаказ(Отказ)
	
	Возврат; // Отключил 21.03.22
	
	ДатаСтарта = Дата("20220301");
	
	Если Дата <= ДатаСтарта
		Или РольДоступна("IT_РазрешитьПроведениеПоступленийБезЗаказов") Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказПоставщику) Или ЗначениеЗаполнено(IT_ЗаявкаВБитрикс24) Тогда 
		Возврат;
	КонецЕсли;
	
	Текст = "С " + Формат(ДатаСтарта, "ДЛФ=DD") + " необходимо обязательно заполнять «Заказ поставщику» или «Заявка в битрикс 24»";
				
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект,,, Отказ);

КонецПроцедуры

Процедура IT_ПроверитьЗаполненДоговор(Отказ)
	//SD70726

	Возврат; // Отключил 21.03.22
	
	ДатаСтарта = Дата("20220301");
	
	Если Дата <= ДатаСтарта Тогда 
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Договор) Тогда 
		Возврат;
	КонецЕсли;
	
	Текст = "С " + Формат(ДатаСтарта, "ДЛФ=DD") + " необходимо обязательно заполнять «Договор»";
				
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, "Договор",, Отказ);

КонецПроцедуры