Функция ПолучитьДополнительнуюНастройку(Настройка, Сообщать = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Настройка) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПрограммы.Значение КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.IT_НастройкиПрограммы КАК НастройкиПрограммы
	|ГДЕ
	|	НастройкиПрограммы.Настройка = &Настройка";
	
	Запрос.УстановитьПараметр("Настройка", Настройка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Если Сообщать Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена настройка: " + Настройка);
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ЗначениеВозврата = ВыборкаДетальныеЗаписи.ЗначениеНастройки;
	
	ЗначениеВозврата = ЗначениеВозврата.Получить();
	
	Возврат ЗначениеВозврата;
	
КонецФункции

