
&После("ОбработкаПолученияДанныхВыбора")
Процедура IT_ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	//<<ДеевС 30.05.2025 Отбор для отображения и выбора Помеченных на удаление объектов CPM-171	
	СтандартнаяОбработка = Истина;
	Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
		Если НЕ Параметры.Свойство("Отбор") Тогда
			Параметры.Вставить("Отбор", Новый Структура);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Параметры.Отбор.Свойство("ПометкаУдаления") Тогда
		Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли;
	//>>ДеевС	
КонецПроцедуры

&После("ОбработкаПолученияФормы")
Процедура IT_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	//<<ДеевС 30.05.2025 Отбор для отображения и выбора Помеченных на удаление объектов CPM-171	
	Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
		Если ВидФормы = "ФормаСписка" ИЛИ ВидФормы = "ФормаВыбора" Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = ВидФормы;		
			Если НЕ Параметры.Свойство("Отбор") Тогда
				Параметры.Вставить("Отбор", Новый Структура);
			КонецЕсли;
			
			Параметры.Отбор.Вставить("ПометкаУдаления",Ложь);
		КонецЕсли;		
	КонецЕсли;
//>>ДеевС
КонецПроцедуры
