
&Перед("ПередЗаписью")
Процедура IT_ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекПользователь     = ПолучитьТекущегоПользователя();
	
	РазрешитьРедактирование = Ложь;
	МассивГруппДоступа     = Новый Массив;
	МассивГруппДоступа.Добавить("Редактирование справочников обмена");
	РазрешитьРедактирование = ПользовательВходитВГруппыДоступаПрофилей(ТекПользователь, МассивГруппДоступа); 
	Если НЕ РазрешитьРедактирование Тогда
		Сообщение     = Новый СообщениеПользователю;
		Сообщение.Текст = "Справочник ""Статьи Затрат"" доступен к редактированию только в базе 1С Управление Холдингом.";
		Сообщение.Сообщить();
	КонецЕсли;
	Отказ         = НЕ РазрешитьРедактирование;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) Тогда
		
		Если ЭтотОбъект.Родитель.Код = "00-005784" Тогда //Статьи 2025
			
			Отказ = Истина;
			
			Сообщение     = Новый СообщениеПользователю;
			Сообщение.Текст = "Справочник ""Статьи Затрат"" доступен к редактированию только в базе 1С Управление Холдингом.";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПользовательВходитВГруппыДоступаПрофилей(Пользователь, ПрофилиГруппДоступа)
	
	РезультатФункции = ЛОЖЬ;
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|  1
	|ИЗ
	|  Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|  ГруппыДоступа.Профиль.Наименование В (&ПрофилиГруппДоступа)
	|  И ГруппыДоступа.Пользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("ПрофилиГруппДоступа", ПрофилиГруппДоступа);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		РезультатФункции = ИСТИНА;  
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат РезультатФункции;
	
КонецФункции

Функция ПолучитьТекущегоПользователя ()
	
	ТекПольз = ПользователиИнформационнойБазы.ТекущийПользователь();
	спрПольз = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",ТекПольз.УникальныйИдентификатор);
	Возврат спрПольз;
	
КонецФункции