&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка") тогда 	
		ДополнительнаяОбработкаСсылка = Параметры.ДополнительнаяОбработкаСсылка;
		ИдентификаторКоманды = Параметры.ИдентификаторКоманды;
		ОбъектыНазначения.ЗагрузитьЗначения(Параметры.ОбъектыНазначения);
		
		МассивЗначений=Параметры.ОбъектыНазначения;
		Если Тип("СправочникСсылка.Сотрудники") = ТипЗнч(МассивЗначений[0]) тогда
			МассивСотрудников = ОбъектыНазначения;
			
			ОбъектыНазначения1 = ПолучитьМассивПриема(МассивЗначений);
			ЗаполнитьТаблицуОтветственных(ОбъектыНазначения1[0]);
		Иначе 
			ЗаполнитьТаблицуОтветственных(МассивЗначений[0]);
		КонецЕсли;	//	Печать("ФК_ТрудовойДоговор");
		
		
	Иначе
		Элементы.ГруппаТест.Видимость=Истина;
	КонецЕсли; 
	//Если Тип("СправочникСсылка.Сотрудники") = ТипЗнч(ОбъектыНазначения[0]) тогда
	//	МассивСотрудников = ОбъектыНазначения;
	//	
	//	ОбъектыНазначения1 = ПолучитьМассивПриема(МассивСотрудников);
	//	Организация=ОбъектыНазначения1[0].Организация;
	//	Дата=ОбъектыНазначения1[0].Дата;
	//Иначе 
	//	Организация=ОбъектыНазначения[0].Значение.Организация;
	//	Дата=ОбъектыНазначения[0].Значение.Дата;
	//	
	//КонецЕсли;
	
КонецПроцедуры

//ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ

&НаКлиенте
Процедура Печать(ИднКоманды=Неопределено)экспорт 
	Если ИднКоманды<>Неопределено тогда
		ИдентификаторКоманды=ИднКоманды;	
	КонецЕсли;
	
	МассивЗначений=новый Массив;
	Для каждого ЭлементСписка из ОбъектыНазначения цикл 
		МассивЗначений.Добавить(ЭлементСписка.Значение);
		//	Сообщить(ЭлементСписка.Значение);
	КонецЦикла;
	
	
	Если Тип("СправочникСсылка.Сотрудники") = ТипЗнч(МассивЗначений[0]) тогда
		МассивСотрудников = МассивЗначений;
		
		МассивЗначений = ПолучитьМассивПриема(МассивСотрудников);
		
	КонецЕсли;
	
	Показатель_ЦелевойРазмерПремии = MRS_Сервер.ЗначениеПредопределенное("ПоказательРасчетаЗарплаты_ЦелевойРазмерПремии");
	
	ПараметрКоманды = МассивЗначений;
	
	// Используется для получения макета.
	ИмяМакета = ИдентификаторКоманды;
	ТипМакета = "DOC"; //Варианты: "DOC", "ODT"
	
	// Получаем всю необходимую информацию из модуля менеджера
	// объекта: данные объекта, описание секций, данные макетов.
	МакетИДанныеОбъекта = ПолучитьДанныеПечати(ПараметрКоманды,ИмяМакета,ТипМакета); 
	
	ПараметрКоманды = ПолучитьСотрудников(ПараметрКоманды);
	
	Для Каждого ДокументСсылка Из ПараметрКоманды Цикл
		ДвоичныеДанныеМакетов = МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
		
		Области= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
		
		ДанныеОбъекта = МакетИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];
		
		Попытка
			
			
			//<<Загребалов И., Апрель-Софт, 25.03.2022.SD63742
			ПечатнаяФорма = СформироватьПечатнуюФорму(ДвоичныеДанныеМакетов, ТипМакета, ДанныеОбъекта, ИмяМакета, Области);
			
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПечатнаяФорма);
			
			ИмяФайла = ПолучитьИмяВременногоФайла(".docx");
			ДвоичныеДанные.Записать(ИмяФайла);
			//Создаем COM-объект для работы с Word
			ОбъектВорд = Новый COMОбъект("Word.Application");
			ОбъектВорд.Documents.add(ИмяФайла);
			//В Word можно открывать в одном приложении несколько документов, поэтому ОбъектВорд.Application.Documents - это коллекция открытых документов.
			//В нашем случае документ открыт всегда один
			ДокументВорд = ОбъектВорд.Application.Documents(1);
			ОбъектВорд.Application.Visible = Истина;
			ДокументВорд.Activate();
			//>>
			
			//<<Загребалов И., Апрель-Софт, 25.03.2022.SD63742
			//УправлениеПечатьюКлиент.ПоказатьДокумент(ПечатнаяФорма);
			//КонецЕсли;
			//>>
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			//Загребалов
			//УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма);
			//УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
			//Загребалов
			Возврат;
		КонецПопытки;
		
		//Загребалов
		//УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма, Ложь);
		//УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
		//Загребалов
	КонецЦикла;
	Закрыть();
	
КонецПроцедуры

Функция ПолучитьМассивПриема(МассивСотрудников)
	
	ДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Истина, МассивСотрудников, "ПриказОПриеме", ТекущаяДата());
	Если НЕ ДанныеСотрудника.Количество() = 0 тогда
		Возврат ДанныеСотрудника.ВыгрузитьКолонку("ПриказОПриеме");
	КонецЕсли;
	Возврат новый Массив;	
КонецФункции

Функция ПолучитьСотрудников(МассивДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриемНаРаботу.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемНаРаботуСпискомСотрудники.Сотрудник
	|ИЗ
	|	Документ.ПриемНаРаботуСписком.Сотрудники КАК ПриемНаРаботуСпискомСотрудники
	|ГДЕ
	|	ПриемНаРаботуСпискомСотрудники.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивДок);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеПечати(знач МассивДокументов, знач ИмяМакета, знач ТипМакета) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	РезультатЗапросаПоВсемПечатаемымДокументам = ПолучитьДанныеДокументов(МассивДокументов);
	ВыборкаДетальныеЗаписи = РезультатЗапросаПоВсемПечатаемымДокументам.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ВыборкаДетальныеЗаписи));
		ДанныеПоВсемОбъектам.Вставить(ВыборкаДетальныеЗаписи.Сотрудник, ДанныеОбъектаПоМакетам);
		
	КонецЦикла;
	
	
	ОписаниеОбластей = Новый Соответствие;
	
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	//<<АпрельСофт, Котяев Р.А., 2022.02.07, 52917
	//ДвоичныеДанныеМакетов.Вставить(ИмяМакета, РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет"));
	КонстМакетПФ_ТрудовойДоговор = РегистрыСведений.ПЛ_ДополнительныеКонстанты.ВернутьДополнительнуюКонстанту("МакетПФ_ТрудовойДоговор");
	Если КонстМакетПФ_ТрудовойДоговор = Неопределено Тогда 
		ВызватьИсключение "Не найдена дополнительная константа ""МакетПФ_ТрудовойДоговор""";
	КонецЕсли;
	СтруктураФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаИДвоичныеДанные(КонстМакетПФ_ТрудовойДоговор);
	ДвоичныеДанныеМакетов.Вставить(ИмяМакета, СтруктураФайла.ДвоичныеДанные);
	//>>
	
	ТипыМакетов.Вставить(ИмяМакета, ТипМакета); 
	
	ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента(МассивДокументов[0].Организация));
	
	
	Возврат Новый Структура("Данные, Макеты",
	ДанныеПоВсемОбъектам,
	Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
	ОписаниеОбластей,
	ТипыМакетов,
	ДвоичныеДанныеМакетов));
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДокументов(МассивДокументов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриемНаРаботу.Ссылка КАК Ссылка,
	|	ПриемНаРаботу.Сотрудник КАК Сотрудник,
	|	ПриемНаРаботу.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПриемНаРаботу.Должность КАК Должность,
	|	ПриемНаРаботу.ТрудовойДоговорНомер КАК ТрудовойДоговорНомер,
	|	ПриемНаРаботу.ТрудовойДоговорДата КАК ТрудовойДоговорДата,
	|	ПриемНаРаботу.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|	ПриемНаРаботу.ДатаПриема КАК ДатаПриема,
	|	ПриемНаРаботу.Подразделение КАК Подразделение,
	|	ПриемНаРаботу.ВидЗанятости КАК ВидЗанятости,
	|	ПриемНаРаботу.ИныеУсловияДоговора КАК ИныеУсловияДоговора,
	|	NULL КАК ИдентификаторСтрокиСотрудника,
	|	ПриемНаРаботу.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
	|	ПриемНаРаботу.СрочныйДоговор КАК СрочныйДоговор,
	|	ПриемНаРаботу.ДатаЗавершенияТрудовогоДоговора КАК ДатаЗавершенияТрудовогоДоговора,
	|	ПриемНаРаботу.ГрафикРаботы КАК ГрафикРаботы,
	|	ПриемНаРаботу.СрокЗаключенияДоговора КАК СрокЗаключенияДоговора
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Ссылка В(&Ссылка)
	|	И ПриемНаРаботу.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемНаРаботуСпискомСотрудники.Ссылка,
	|	ПриемНаРаботуСпискомСотрудники.Сотрудник,
	|	ПриемНаРаботуСпискомСотрудники.ФизическоеЛицо,
	|	ПриемНаРаботуСпискомСотрудники.Должность,
	|	ПриемНаРаботуСпискомСотрудники.ТрудовойДоговорНомер,
	|	ПриемНаРаботуСпискомСотрудники.ТрудовойДоговорДата,
	|	ПриемНаРаботуСпискомСотрудники.ДолжностьПоШтатномуРасписанию,
	|	ПриемНаРаботуСпискомСотрудники.ДатаПриема,
	|	ПриемНаРаботуСпискомСотрудники.Подразделение,
	|	ПриемНаРаботуСпискомСотрудники.ВидЗанятости,
	|	ПриемНаРаботуСпискомСотрудники.ИныеУсловияДоговора,
	|	ПриемНаРаботуСпискомСотрудники.ИдентификаторСтрокиСотрудника,
	|	ПриемНаРаботуСпискомСотрудники.ДлительностьИспытательногоСрока,
	|	ПриемНаРаботуСпискомСотрудники.СрочныйДоговор КАК СрочныйДоговор,
	|	ПриемНаРаботуСпискомСотрудники.ДатаЗавершенияТрудовогоДоговора КАК ДатаЗавершенияТрудовогоДоговора,
	|	ПриемНаРаботуСпискомСотрудники.ГрафикРаботы КАК ГрафикРаботы,
	|	ПриемНаРаботуСпискомСотрудники.СрокЗаключенияДоговора КАК СрокЗаключенияДоговора
	|ИЗ
	|	Документ.ПриемНаРаботуСписком.Сотрудники КАК ПриемНаРаботуСпискомСотрудники
	|ГДЕ
	|	ПриемНаРаботуСпискомСотрудники.Ссылка В(&Ссылка)
	|	И ПриемНаРаботуСпискомСотрудники.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", МассивДокументов);
	
	возврат Запрос.Выполнить();
	
	
КонецФункции 

&НаСервере
Функция ПолучитьДанныеОбъекта(ВыборкаИзЗапроса)
	
	ДанныеОбъекта = Новый Структура;
	
	ДанныеОбъекта.Вставить("Номер",			ВыборкаИзЗапроса.ТрудовойДоговорНомер);
	ДанныеОбъекта.Вставить("Дата",			СтрЗаменить(Формат(ВыборкаИзЗапроса.ТрудовойДоговорДата, "ДЛФ=DD"), "г.", ""));
	ДанныеОбъекта.Вставить("Подразделение",	ВыборкаИзЗапроса.Подразделение);
	ДанныеОбъекта.Вставить("Должность",		ВыборкаИзЗапроса.Должность);
	ДанныеОбъекта.Вставить("ДатаПриема",	СтрЗаменить(Формат(ВыборкаИзЗапроса.ДатаПриема, "ДЛФ=DD"), "г.", ""));
	
	ДанныеОбъекта.Вставить("ВидДеятельности",	?(ВыборкаИзЗапроса.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы, "основной", "по совметительству"));
	
	ДанныеОбъекта.Вставить("ДоплатаВредныеУсловия", "");
	
	Если Тип("ДокументСсылка.ПриемНаРаботу") = ТипЗнч(ВыборкаИзЗапроса.Ссылка) тогда
		
		Показатели = ВыборкаИзЗапроса.Ссылка.Показатели.Выгрузить();
		
		Для каждого СтрНачисления из Показатели цикл
			Если СтрНачисления.Показатель.Наименование = "Процент вредности" или СтрНачисления.Показатель.Наименование = "Процент для Доплата за вредные условия труда" тогда
				ДанныеОбъекта.Вставить("ДоплатаВредныеУсловия", "Доплата за вредные условия труда " + СтрНачисления.Значение + "%.");
			ИначеЕсли СтрНачисления.Показатель.Наименование = "Оклад" тогда
				ДанныеОбъекта.Вставить("Оклад",	СтрНачисления.Значение);
				ДанныеОбъекта.Вставить("ОкладПрописью",	СтрЗаменить(ЧислоПрописью(СтрНачисления.Значение, "Л = ru_RU;", "рубль, рубля, рублей, м"), " 00 ", ""));
			ИначеЕсли СтрНачисления.Показатель = Показатель_ЦелевойРазмерПремии Тогда
				ДанныеОбъекта.Вставить("ЦелеваяПремия",	СтрНачисления.Значение);
				ДанныеОбъекта.Вставить("ЦелеваяПремияПрописью",	СтрЗаменить(ЧислоПрописью(СтрНачисления.Значение, "Л = ru_RU;", "рубль, рубля, рублей, м"), " 00 ", ""));
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		ПоказСотр = ВыборкаИзЗапроса.Ссылка.Показатели.НайтиСтроки(новый Структура("ИдентификаторСтрокиСотрудника", ВыборкаИзЗапроса.ИдентификаторСтрокиСотрудника));
		Для каждого СтрНачисления из ПоказСотр цикл
			Если СтрНачисления.Показатель.Наименование = "Процент вредности" или СтрНачисления.Показатель.Наименование = "Процент для Доплата за вредные условия труда" тогда
				
				ДанныеОбъекта.Вставить("ДоплатаВредныеУсловия", "Доплата за вредные условия труда " + СтрНачисления.Значение + "%.");
			ИначеЕсли СтрНачисления.Показатель.Наименование = "Оклад" тогда
				ДанныеОбъекта.Вставить("Оклад",	СтрНачисления.Значение);
				ДанныеОбъекта.Вставить("ОкладПрописью",	СтрЗаменить(ЧислоПрописью(СтрНачисления.Значение, "Л = ru_RU;", "рубль, рубля, рублей, м"), " 00 ", ""));	
			ИначеЕсли СтрНачисления.Показатель = Показатель_ЦелевойРазмерПремии Тогда
				ДанныеОбъекта.Вставить("ЦелеваяПремия",	СтрНачисления.Значение);
				ДанныеОбъекта.Вставить("ЦелеваяПремияПрописью",	СтрЗаменить(ЧислоПрописью(СтрНачисления.Значение, "Л = ru_RU;", "рубль, рубля, рублей, м"), " 00 ", ""));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	ДанныеОбъекта.Вставить("КолДнейОсновной" "");
	ДанныеОбъекта.Вставить("ДопОтпуск", "");
	
	Если Тип("ДокументСсылка.ПриемНаРаботу") = ТипЗнч(ВыборкаИзЗапроса.Ссылка) тогда
		
		Для каждого СтрОтпуск из ВыборкаИзЗапроса.Ссылка.ЕжегодныеОтпуска цикл
			Если СтрОтпуск.ВидЕжегодногоОтпуска = Справочники.ВидыОтпусков.Основной тогда	
				ДанныеОбъекта.Вставить("КолДнейОсновной", СтрОтпуск.КоличествоДнейВГод);
			Иначе
				ДанныеОбъекта.Вставить("ДопОтпуск", " и " + Строка(СтрОтпуск.ВидЕжегодногоОтпуска) 
				+ " " + СтрОтпуск.КоличествоДнейВГод + " календарных дней");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ОтпускаСотр = ВыборкаИзЗапроса.Ссылка.ЕжегодныеОтпуска.НайтиСтроки(новый Структура("ИдентификаторСтрокиСотрудника", ВыборкаИзЗапроса.ИдентификаторСтрокиСотрудника));
		Для каждого СтрОтпуск из ОтпускаСотр цикл
			Если СтрОтпуск.ВидЕжегодногоОтпуска = Справочники.ВидыОтпусков.Основной тогда	
				ДанныеОбъекта.Вставить("КолДнейОсновной", СтрОтпуск.КоличествоДнейВГод);
			Иначе
				ДанныеОбъекта.Вставить("ДопОтпуск", " и " + НРег(Строка(СтрОтпуск.ВидЕжегодногоОтпуска)) 
				+ " " + СтрОтпуск.КоличествоДнейВГод + " календарных дней");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	
	ВыводитьПодписанта = ПолучитьДопРеквизитыОбъектов(ВыборкаИзЗапроса.Подразделение,"Выводить подписанта (Подразделения)");
	
	Если ВыводитьПодписанта = "" Тогда 
		ВыводитьПодписанта = Ложь;
	КонецЕсли;
	ВыводитьПодписанта=Истина;	
	Если ВыводитьПодписанта Тогда
		Подписант = ОтветсвенноеЛицо;
		
		ДолжностьПодписанта = Должность.Наименование;//ПолучитьДопРеквизитыОбъектов(СтрокаТЧ.Подразделение,"Должность подписанта (Подразделения)"); 
		
		ДолжностьПодписантаВРодПадеже = ПросклонятьДолжность(ДолжностьПодписанта,2);
		
		Если Подписант.Пол = ПолучитьПолФизЛицаПеречисление("Мужской") Тогда 
			Пол = 1;
		ИначеЕсли Подписант.Пол = ПолучитьПолФизЛицаПеречисление("Женский") Тогда 
			Пол = 2;
		Иначе 	
			Пол = 1;
		КонецЕсли;
		
		РезультатСклонения = ПросклонятьПредставлениеВРодительномПадеже(Подписант,Истина,Пол,Ложь);
		
		ФиоРук = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Подписант);
		
		ДанныеОбъекта.Вставить("ФИОПодписантаСокр", ФиоРук);
		
		ДанныеОбъекта.Вставить("ДолжностьПодписанта", ДолжностьПодписантаВРодПадеже);
		ДанныеОбъекта.Вставить("ДолжностьПодписантаБезСкл", ДолжностьПодписанта);
		
		ДанныеОбъекта.Вставить("Подписант", РезультатСклонения);
		
		//НомерИДатаДоверенности = ПолучитьДопРеквизитыОбъектов(ВыборкаИзЗапроса.Подразделение,"Номер и дата доверенности (Подразделения)");
		
		ДанныеОбъекта.Вставить("ОснованиеПодписанта", ОснованиеПраваПодписиВРодПадеже);
	Иначе
		
		ДанныеОбъекта.Вставить("ДолжностьПодписанта", "Директора");
		ДанныеОбъекта.Вставить("ДолжностьПодписантаБезСкл", "Директор");
		
		НайденныеСтроки = ПолучитьОтветственныеЛицаОрганизации();
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			
			Если НайденныеСтроки.РуководительПол = ПолучитьПолФизЛицаПеречисление("Мужской") Тогда 
				Пол = 1;
			ИначеЕсли НайденныеСтроки.РуководительПол = ПолучитьПолФизЛицаПеречисление("Женский") Тогда 
				Пол = 2;
			Иначе 	
				Пол = 1;
			КонецЕсли;
			РезультатСклонения = ПросклонятьПредставлениеВРодительномПадеже(НайденныеСтроки.РуководительНаименование,Истина,Пол,Ложь);
			ДанныеОбъекта.Вставить("Подписант", РезультатСклонения);
			
			
			РуководительИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(НайденныеСтроки.РуководительНаименование);
			
			ДанныеОбъекта.Вставить("ФИОПодписантаСокр", РуководительИнициалы);
			
		КонецЕсли;
		
		ДанныеОбъекта.Вставить("ОснованиеПодписанта", "Устава");
		
	КонецЕсли;
	
	
	ДанныеОбъекта.Вставить("ВредныеУсловия", ?(ДанныеОбъекта.ДоплатаВредныеУсловия = "", "не предусмотрено.", "доплата за вредные условия труда."));
	
	Если ЗначениеЗаполнено(ВыборкаИзЗапроса.ИныеУсловияДоговора) тогда
		ДанныеОбъекта.Вставить("ХарактерРаботы", ВыборкаИзЗапроса.ИныеУсловияДоговора);
	Иначе
		ДанныеОбъекта.Вставить("ХарактерРаботы", "не предусмотрено");
	КонецЕсли;
	
	ДанныеОбъекта.Вставить("УсловиеТруда",  " " + ПолучитьКласУсловияТруда(ВыборкаИзЗапроса.ДолжностьПоШтатномуРасписанию, ВыборкаИзЗапроса.ДатаПриема));
	
	
	ДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаИзЗапроса.Сотрудник), 
	"Страна, ФИОПолные, ФамилияИО, ДатаРождения, СтраховойНомерПФР, АдресМестаПроживанияПредставление, ТелефонМобильныйПредставление, ИНН, АдресПоПропискеПредставление, ДокументПредставление", ВыборкаИзЗапроса.ДатаПриема);
	Для каждого СтрДанСотр из ДанныеСотрудника цикл
		
		ДанныеОбъекта.Вставить("ФИОСотрудника",	СтрДанСотр.ФИОПолные);
		ДанныеОбъекта.Вставить("ДатаРождения", "Дата рождения: " + Формат(СтрДанСотр.ДатаРождения, "ДЛФ=D"));
		ДанныеОбъекта.Вставить("ДокументПредставление",	СтрЗаменить(СтрДанСотр.ДокументПредставление, "код подр.", "код подразделения "));
		ДанныеОбъекта.Вставить("АдресПрописки",	СтрДанСотр.АдресПоПропискеПредставление);
		//ДанныеОбъекта.Вставить("ПочтовыйАдрес",	СтрДанСотр.АдресМестаПроживанияПредставление);
		ДанныеОбъекта.Вставить("ИНН",	СтрДанСотр.ИНН);
		ДанныеОбъекта.Вставить("СНИЛС",	СтрДанСотр.СтраховойНомерПФР);
		ДанныеОбъекта.Вставить("Телефон",	СтрДанСотр.ТелефонМобильныйПредставление);
		ДанныеОбъекта.Вставить("ФИОСотрудникаСокр",	СтрДанСотр.ФамилияИО);
		Если СтрДанСотр.Страна.НаименованиеПолное = "Украина" тогда
			ДанныеОбъекта.Вставить("Гражданство", "Гражданин Украины");
		Иначе
			УстановитьПривилегированныйРежим(Истина);
			ДанныеОбъекта.Вставить("Гражданство",	"Гражданин " + ?(СтрДанСотр.Страна = Справочники.СтраныМира.Россия, "РФ", СклонениеПредставленийОбъектов.ПросклонятьПредставление(СтрДанСотр.Страна.НаименованиеПолное, 2)));
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;	
	КонецЦикла;
	
	Если ВыборкаИзЗапроса.СрочныйДоговор тогда
		ДатаЗавершения = ВыборкаИзЗапроса.ДатаЗавершенияТрудовогоДоговора;
		ДанныеОбъекта.Вставить("ПериодДоговора", "с " + Формат(ВыборкаИзЗапроса.ДатаПриема, "ДФ='dd.MM.yyyy ""г.""'") + ?(ЗначениеЗаполнено(ДатаЗавершения), " по " + Формат(ДатаЗавершения, "ДФ='dd.MM.yyyy ""г.""'"), ""));
	Иначе	
		ДанныеОбъекта.Вставить("ПериодДоговора", "на неопределенный срок");
	КонецЕсли;
	//Если ВыборкаИзЗапроса.Ссылка.СрочныйДоговор тогда
	//	ДатаЗавершения = ВыборкаИзЗапроса.Ссылка.ДатаЗавершенияТрудовогоДоговора;
	//	ДанныеОбъекта.Вставить("ПериодДоговора", "с " + Формат(ВыборкаИзЗапроса.ДатаПриема, "ДФ='dd.MM.yyyy ""г.""'") + ?(ЗначениеЗаполнено(ДатаЗавершения), " по " + Формат(ДатаЗавершения, "ДФ='dd.MM.yyyy ""г.""'"), ""));
	//Иначе	
	//    ДанныеОбъекта.Вставить("ПериодДоговора", "на неопределенный срок");
	//КонецЕсли;
	
	
	Если ВыборкаИзЗапроса.Ссылка.Организация.ИНН = "9103007830" тогда
		ДанныеОбъекта.Вставить("НаименованиеОрганизации", "ООО «МРИЯ»");
		
		ДанныеОбъекта.Вставить("ПолноеНаименованиеОрганизации", "Общество с ограниченной ответственностью ""МРИЯ""");
		
		РеквГаранта = "ИНН 9103007830  КПП 910301001   
		|ОГРН 1149102066740 ОКПО 00717399
		|Юр. адрес/адрес для корреспонденции: 298685, РФ, Республика Крым, г. Ялта, с. Оползневое, ул. Генерала Острякова, № 9
		|Р/с 40702810942580200027 в 
		|РНКБ Банк (ПАО) К/с 30101810335100000607
		|БИК 043510607
		|Тел.: +7(3654) 222-333";
		
		ДанныеОбъекта.Вставить("РеквОрганизации", РеквГаранта);
		
		ДанныеОбъекта.Вставить("Приказ", Символы.ПС + "(утв. Приказом от 10.12.2018)");
		
		ДанныеОбъекта.Вставить("ПриказОрганизации", "Стандарт ООО «МРИЯ» по раскрытию работниками информации о потенциальных конфликтах интересов от 03.08.2018 года.");
		ДанныеОбъекта.Вставить("ПоложениеОрганизации","Положение об оплате труда МРИЯ от 03.04.2019 № 107-А");
		
		Местонахождение	= "Республика Крым, г. Ялта, с. Оползневое";	
		ДанныеОбъекта.Вставить("Местонахождение", Местонахождение);	
		
	ИначеЕсли ВыборкаИзЗапроса.Ссылка.Организация.ИНН = "9101001550" тогда
		ДанныеОбъекта.Вставить("НаименованиеОрганизации", "ООО «МРИЯ.ГАСТРО»");
		
		ДанныеОбъекта.Вставить("ПолноеНаименованиеОрганизации", "Общество с ограниченной ответственностью «МРИЯ.ГАСТРО»");
		
		РеквГаранта = "ИНН 9101001550  КПП 910301001   
		|ОГРН 1149102053803 ОКПО 00704617
		|Юр. адрес/адрес для корреспонденции: 298685, Республика Крым, г. Ялта, с. Оползневое, ул. Генерала Острякова, д.9
		|Р/с 40702810942590041797 в 
		|РНКБ Банк (ПАО) К/с 30101810335100000607
		|БИК 043510607
		|Тел.: +7(3654) 222-333";
		
		ДанныеОбъекта.Вставить("РеквОрганизации", РеквГаранта);
		
		ДанныеОбъекта.Вставить("Приказ","");
		
		ДанныеОбъекта.Вставить("ПриказОрганизации", "Политика ООО «МРИЯ.ГАСТРО» по управлению конфликтом интересов №30-07/18 от 30.07.2018 года.");
		ДанныеОбъекта.Вставить("ПоложениеОрганизации","Положение об оплате труда МРИЯ.ГАСТРО от 03.04.2019 № 45-А");
		
		Местонахождение	= "Республика Крым, г. Ялта, с. Оползневое";	
		ДанныеОбъекта.Вставить("Местонахождение", Местонахождение);
		//Быкодаров 09.10.2024 Добавление МРИИ.ТЕРРУАР в печатную форму
	ИначеЕсли ВыборкаИзЗапроса.Ссылка.Организация.ИНН = "9200023330" тогда
		ДанныеОбъекта.Вставить("НаименованиеОрганизации", "ООО «МРИЯ.ТЕРРУАР»");
		
		ДанныеОбъекта.Вставить("ПолноеНаименованиеОрганизации", "Общество с ограниченной ответственностью «МРИЯ.ТЕРРУАР»");
		
		РеквГаранта = "ИНН 9200023330  КПП 920001001   
		|ОГРН 1249100011302 ОКПО 71740232
		|Юр. адрес/адрес для корреспонденции: 299011, Город Севастополь, вн.тер.г. Ленинский муниципальный округ, ул Демидова, Дом 13, помещ 1 / каб 107
		|Р/с 40702810652000006643 в 
		|ЮГО-ЗАПАДНЫЙ БАНК ПАО СБЕРБАНК К/с 30101810600000000602
		|БИК 046015602
		|Тел.: +7(3654) 222-333";
		
		ДанныеОбъекта.Вставить("РеквОрганизации", РеквГаранта);
		
		ДанныеОбъекта.Вставить("Приказ","");
		
		ДанныеОбъекта.Вставить("ПриказОрганизации", "Политика ООО «МРИЯ.ТЕРРУАР» по управлению конфликтом интересов №30-07/18 от 30.07.2018 года.");
		ДанныеОбъекта.Вставить("ПоложениеОрганизации","Положение об оплате труда МРИЯ.ТЕРРУАР от 03.04.2019 № 45-А");
		
		Местонахождение	= "Республика Крым, г. Севастополь, вн.тер.г. Ленинский муниципальный округ";	
		ДанныеОбъекта.Вставить("Местонахождение", Местонахождение);
		
		//Быкодаров 09.10.2024
		
		//Быкодаров 20.11.2024 Добавление РУСЬ в печатную форму
	ИначеЕсли ВыборкаИзЗапроса.Ссылка.Организация.ИНН = "9103100540" тогда
		ДанныеОбъекта.Вставить("НаименованиеОрганизации", "ООО «РУСЬ»");
		
		ДанныеОбъекта.Вставить("ПолноеНаименованиеОрганизации", "Общество с ограниченной ответственностью «РУСЬ»");
		
		РеквГаранта = "ИНН 9103100540  КПП 910301001   
		|ОГРН 1229100013713 ОКПО 93042557
		|Юр. адрес/адрес для корреспонденции: 298671, Республика Крым, г.о. Ялта, пгт Кореиз, ш Алупкинское, д. 52
		|Р/с 40702810642560000411 в 
		|РНКБ БАНК (ПАО) К/с 30101810335100000607
		|БИК 046015602
		|Тел.: +7(3654) 222-333";
		
		ДанныеОбъекта.Вставить("РеквОрганизации", РеквГаранта);
		
		ДанныеОбъекта.Вставить("Приказ","");
		
		ДанныеОбъекта.Вставить("ПриказОрганизации", "Политика ООО «РУСЬ» по управлению конфликтом интересов №30-07/18 от 30.07.2018 года.");
		ДанныеОбъекта.Вставить("ПоложениеОрганизации","Положение об оплате труда РУСЬ от 03.04.2019 № 45-А");
		
		Местонахождение	= "Республика Крым, г. Севастополь, вн.тер.г. Ленинский муниципальный округ";	
		ДанныеОбъекта.Вставить("Местонахождение", Местонахождение);
		
		//Быкодаров 20.11.2024
		
	ИначеЕсли ВыборкаИзЗапроса.Ссылка.Организация.ИНН = "9724147928" тогда
		ДанныеОбъекта.Вставить("НаименованиеОрганизации", "АНО ДПО «ОБУЧАЮЩИЙ ЦЕНТР ОРБИТА»");
		
		ДанныеОбъекта.Вставить("ПолноеНаименованиеОрганизации", "Автономная некоммерческая организация дополнительного профессионального образования «ОРБИТА»");
		
		РеквГаранта = "ИНН 9724147928  КПП 772401001   
		|ОГРН 1237700640605 ОКПО 55024967
		|Юр. адрес/адрес для корреспонденции: 115230, Город Москва, проезд Хлебозаводский, д. 7, помещ. 33/Н
		|Р/с 40703810152000000591 в 
		|ПАО Сбербанк К/с 30101810600000000602
		|БИК 046015602
		|Тел.: +7(978) 863-82-22";
		
		ДанныеОбъекта.Вставить("РеквОрганизации", РеквГаранта);
		
		ДанныеОбъекта.Вставить("Приказ","");
		
		ДанныеОбъекта.Вставить("ПриказОрганизации", "Политика ООО «РУСЬ» по управлению конфликтом интересов №30-07/18 от 30.07.2018 года.");
		ДанныеОбъекта.Вставить("ПоложениеОрганизации","Положение об оплате труда РУСЬ от 03.04.2019 № 45-А");
		
		Местонахождение	= "Республика Крым, г. Севастополь, вн.тер.г. Ленинский муниципальный округ";	
		ДанныеОбъекта.Вставить("Местонахождение", Местонахождение);
		
		//КОИ 02.09.2025
		
	ИначеЕсли ВыборкаИзЗапроса.Ссылка.Организация.ИНН = "9103103854" тогда
		ДанныеОбъекта.Вставить("НаименованиеОрганизации", "ООО «МРИЯ.ДЕВЕЛОПМЕНТ»");
		
		ДанныеОбъекта.Вставить("ПолноеНаименованиеОрганизации", "Общество с ограниченной ответственностью «МРИЯ.ДЕВЕЛОПМЕНТ»");
		
		РеквГаранта = "ИНН 9103103854  КПП 910301001   
		|ОГРН 1249100005549 ОКПО 00704617
		|Юр. адрес/адрес для корреспонденции: 298685, Республика Крым, г. Ялта, с. Оползневое, ул. Генерала Острякова, д.9
		|Р/с 40702810942590041797 в 
		|РНКБ Банк (ПАО) К/с 30101810335100000607
		|БИК 043510607
		|Тел.: +7(3654) 222-333";	
		
		ДанныеОбъекта.Вставить("РеквОрганизации", РеквГаранта);
		
		ДанныеОбъекта.Вставить("Приказ","");
		
		ДанныеОбъекта.Вставить("ПриказОрганизации", "Политика ООО «МРИЯ.ДЕВЕЛОПМЕНТ» по управлению конфликтом интересов №30-07/18 от 30.07.2018 года.");
		ДанныеОбъекта.Вставить("ПоложениеОрганизации","Положение об оплате труда МРИЯ.ДЕВЕЛОПМЕНТ от 03.04.2019 № 45-А");
		
		Местонахождение	= "Республика Крым, г. Ялта, с. Оползневое";	
		ДанныеОбъекта.Вставить("Местонахождение", Местонахождение);	
		
	Иначе
		ДанныеОбъекта.Вставить("НаименованиеОрганизации", "ООО ""МРИЯ.ПРО""");
		
		ДанныеОбъекта.Вставить("ПолноеНаименованиеОрганизации", "Общество с ограниченной ответственностью ""МРИЯ.ПРО""");
		
		РеквГаранта = "ИНН 9103069850  КПП 910301001   
		|ОГРН 1159102069125 ОКПО 00910104
		|Юр. адрес/адрес для корреспонденции: 298685, Крым Респ, Ялта г, Оползневое с, Севастопольское ш, дом № 2
		|Р/с 40702810007280004007 в 
		|Симферопольский филиал АБ Россия К/с 30101810835100000107
		|БИК 043510107
		|Тел.: +7(3654) 222-333";
		
		ДанныеОбъекта.Вставить("РеквОрганизации", РеквГаранта);
		
		ДанныеОбъекта.Вставить("Приказ","");
		
		ДанныеОбъекта.Вставить("ПриказОрганизации", "");
		ДанныеОбъекта.Вставить("ПоложениеОрганизации","");
		
		Местонахождение	= "Республика Крым, г. Ялта, с. Оползневое";	//, ул. Севастопольское ш, дом № 2";
		ДанныеОбъекта.Вставить("Местонахождение", Местонахождение);	
		
	КонецЕсли;
	
	
	Если ВыборкаИзЗапроса.ДлительностьИспытательногоСрока = 0 тогда
		ДанныеОбъекта.Вставить("ИспытательныйСрок", "Работник принимается без испытания.");	
	Иначе
		ЧислоПроп = ЧислоПрописью(ВыборкаИзЗапроса.ДлительностьИспытательногоСрока);
		ЧислоПроп = СтрЗаменить(ЧислоПроп, " ", "");
		ЧислоПроп = СтрЗаменить(ЧислоПроп, "00", "");
		ЧислоПроп = НРег(ЧислоПроп);
		ДанныеОбъекта.Вставить("ИспытательныйСрок", "С целью проверки соответствия Работника поручаемой работе, ему устанавливается испытание на срок " 
		+ ВыборкаИзЗапроса.ДлительностьИспытательногоСрока + " (" + ЧислоПроп 
		+ ") " + ПолучитьМесяц(ВыборкаИзЗапроса.ДлительностьИспытательногоСрока) + ".");	
	КонецЕсли;
	
	// действие трудового договора
	ЗавершениеТрудовогоДоговора	= "";
	Если ЗначениеЗаполнено(ВыборкаИзЗапроса.ДатаЗавершенияТрудовогоДоговора) тогда
		ЗавершениеТрудовогоДоговора	= "Дата окончания (срок) действия трудового договора: " + СтрЗаменить(Формат(ВыборкаИзЗапроса.ДатаЗавершенияТрудовогоДоговора, "ДЛФ=DD"), "г.", " года.");
		ДанныеОбъекта.Вставить("СрокТрудовогоДоговора", "Трудовой договор заключен на определенный срок: по " + СтрЗаменить(Формат(ВыборкаИзЗапроса.ДатаЗавершенияТрудовогоДоговора, "ДЛФ=DD"), "г.", " года."));	
		
	Иначе
		
		СтрМестоРаботы = "";
		//<<Загребалов И., Апрель-Софт, 26.11.2021.SD65521, правка заполнения
		//Если ВыборкаИзЗапроса.Ссылка.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы Тогда
		Если ВыборкаИзЗапроса.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы Тогда
			//>>
			СтрМестоРаботы = "по основному месту работы.";
			//<<Загребалов И., Апрель-Софт, 26.11.2021.SD65521, правка заполнения
			//ИначеЕсли ВыборкаИзЗапроса.Ссылка.ВидЗанятости = Перечисления.ВидыЗанятости.ВнутреннееСовместительство Тогда
		ИначеЕсли ВыборкаИзЗапроса.ВидЗанятости = Перечисления.ВидыЗанятости.ВнутреннееСовместительство Тогда
			//>>
			СтрМестоРаботы = "по внутреннему совместительству.";
			//<<Загребалов И., Апрель-Софт, 26.11.2021.SD65521, правка заполнения
			//ИначеЕсли ВыборкаИзЗапроса.Ссылка.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство Тогда
		ИначеЕсли ВыборкаИзЗапроса.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство Тогда
			//>>
			СтрМестоРаботы = "по внешнему совместительству.";
		КонецЕсли;
		ДанныеОбъекта.Вставить("СрокТрудовогоДоговора", "Трудовой договор заключен на неопределенный срок, " + СтрМестоРаботы);	
		
		
	КонецЕсли;
	ДанныеОбъекта.Вставить("ДействиеТрудовогоДоговора", "Дата начала действия трудового договора: " + СтрЗаменить(Формат(ВыборкаИзЗапроса.ДатаПриема, "ДЛФ=DD"), "г.", " года.") + ?(ЗавершениеТрудовогоДоговора <> "", Символы.ПС + ЗавершениеТрудовогоДоговора, ""));	
	
	
	// длительность недели по графику
	КвоЧасов	= ВыборкаИзЗапроса.ГрафикРаботы.ДлительностьРабочейНедели;
	ДанныеОбъекта.Вставить("КвоЧасовВНеделю", Строка(КвоЧасов));	
	//		КвоЧасов	= ВыборкаИзЗапроса.Ссылка.ГрафикРаботы.ДлительностьРабочейНедели;
	//ДанныеОбъекта.Вставить("КвоЧасовВНеделю", Строка(КвоЧасов));
	
	//Местонахождение	= "Республика Крым, г. Ялта, с. Оползневое, ул. Генерала Острякова, №9";
	//ДанныеОбъекта.Вставить("Местонахождение", Местонахождение);	
	
	
	//ДанныеОбъекта.Вставить("<ИмяПараметра1>",	ВыборкаИзЗапроса.<ИмяВыходногоПоляЗапроса1>);
	//ДанныеОбъекта.Вставить("<ИмяПараметра2>",	ВыборкаИзЗапроса.<ИмяВыходногоПоляЗапроса2>);
	//
	//ДанныеОбъекта.Вставить("Товары", Новый Массив);
	//
	//ИтогПОСумме = 0;
	//Для Каждого СтрокаТабличнойЧасти Из Объект.Товары.Выгрузить() Цикл   //ag
	//	СтрокаТаблицыТовары = Новый Структура;
	//	СтрокаТаблицыТовары.Вставить("<ИмяПараметраТабл1>",СтрокаТабличнойЧасти.<ИмяВыходногоПоляВложЗапросаПоТЧ1>);
	//	
	//	ДанныеОбъекта.Товары.Добавить(СтрокаТаблицыТовары);
	//   ИтогПОСумме = ИтогПОСумме + СтрокаТабличнойЧасти.<ИмяВыходногоПоляВложЗапросаПоТЧ2>;
	//КонецЦикла;
	//	
	//	//ИтогСумма
	//ДанныеОбъекта.Вставить("<ИмяПараметра3>",	ИтогПОСумме);
	
	Возврат ДанныеОбъекта;
	
КонецФункции



&НаСервере
Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента(мОрганизация = "")
	
	ОписаниеОбластей = Новый Структура;
	
	//УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ВерхнийКолонтитул",	"ВерхнийКолонтитул");
	//УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "НижнийКолонтитул",		"НижнийКолонтитул");
	//
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",			"Общая");
	
	// Дрожанов
	Если ЗначениеЗаполнено(мОрганизация) и мОрганизация.Наименование = "МРИЯ" Тогда
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТаблицаГарант",	"Общая");
	ИначеЕсли ЗначениеЗаполнено(мОрганизация) и мОрганизация.Наименование = "МРИЯ.ГАСТРО" Тогда
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТаблицаКипарис",	"Общая");
		//Быкодаров 091024
	ИначеЕсли ЗначениеЗаполнено(мОрганизация) и мОрганизация.Наименование = "МРИЯ.ТЕРРУАР" Тогда
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТаблицаТЕРРУАР",	"Общая");
		//
		//Быкодаров 091024
	ИначеЕсли ЗначениеЗаполнено(мОрганизация) и СтрНайти(мОрганизация.Наименование, "ОРБИТА") > 0 Тогда
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТаблицаОРБИТА", "Общая");
		//КОИ 02.09.2025
	ИначеЕсли ЗначениеЗаполнено(мОрганизация) и мОрганизация.Наименование = "РУСЬ" Тогда
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТаблицаРУСЬ",	"Общая");
		//
	ИначеЕсли ЗначениеЗаполнено(мОрганизация) и мОрганизация.Наименование = "МРИЯ.ДЕВЕЛОПМЕНТ" Тогда
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТаблицаДЕВЕЛОПМЕНТ",	"Общая")		
	ИначеЕсли ЗначениеЗаполнено(мОрганизация) и (мОрганизация.Наименование = "МРИЯ.ПРО" или мОрганизация.Наименование = "МРИЯ.ПРО ООО") Тогда
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТаблицаГоризонт",	"Общая");
	КонецЕсли; 
	// Дрожанов
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",			"Общая");
	
	//УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаТаблицыТовары",	"СтрокаТаблицы");
	//УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаТаблицаТовары",	"СтрокаТаблицы");
	
	
	Возврат ОписаниеОбластей;
	
КонецФункции



&НаКлиенте
Процедура ТестПечатнойФормы(Команда)
	МассивЗначений=Новый Массив;                    
	Для каждого ЭлементСписка из МассивОбъектов цикл 
		МассивЗначений.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	
	ОбъектыНазначения.ЗагрузитьЗначения(МассивЗначений);
	Если Тип("СправочникСсылка.Сотрудники") = ТипЗнч(МассивЗначений[0]) тогда
		МассивСотрудников = ОбъектыНазначения;
		
		ОбъектыНазначения1 = ПолучитьМассивПриема(МассивЗначений);
		ЗаполнитьТаблицуОтветственных(ОбъектыНазначения1[0]);
	Иначе 
		ЗаполнитьТаблицуОтветственных(МассивЗначений[0]);
	КонецЕсли;	//	Печать("ФК_ТрудовойДоговор");
КонецПроцедуры

Процедура ЗаполнитьТаблицуОтветственных(Документ)
	Запрос=новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
	|	MRS_ОтветственныеЛицаСПравомПодписи.Период КАК Период,
	|	MRS_ОтветственныеЛицаСПравомПодписи.Организация КАК Организация,
	|	MRS_ОтветственныеЛицаСПравомПодписи.ОтветсвенноеЛицо КАК ОтветсвенноеЛицо,
	|	MRS_ОтветственныеЛицаСПравомПодписи.Должность КАК Должность,
	|	MRS_ОтветственныеЛицаСПравомПодписи.ОснованиеПраваПодписи КАК ОснованиеПраваПодписи,
	|	MRS_ОтветственныеЛицаСПравомПодписи.ОснованиеПраваПодписиВРодПадеже КАК ОснованиеПраваПодписиВРодПадеже
	|ИЗ
	|	РегистрСведений.MRS_ОтветственныеЛицаСПравомПодписи КАК MRS_ОтветственныеЛицаСПравомПодписи
	|ГДЕ
	|	MRS_ОтветственныеЛицаСПравомПодписи.Организация = &Организация" ;
	
	ЗАпрос.УстановитьПараметр("Организация",Документ.Организация);
	Выборка = запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл 
		НоваястрокаТ=ТаблицаПодписантов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваястрокаТ,Выборка);
	КонецЦикла;
	
	
КонецПроцедуры
Функция ПолучитьКласУсловияТруда(ДолжностьШтат, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассыУсловийТрудаПоДолжностямСрезПоследних.КлассУсловийТруда КАК КлассУсловийТруда
	|ИЗ
	|	РегистрСведений.КлассыУсловийТрудаПоДолжностям.СрезПоследних(&Дата, Должность = &Должность) КАК КлассыУсловийТрудаПоДолжностямСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Должность", ДолжностьШтат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КлассУсловийТруда;
	КонецЦикла;
	
	Возврат "";	
КонецФункции	



Функция ПолучитьДопРеквизитыОбъектов(Знач ОбъектДоп, ХарактеристикаТекст)
	
	Если ТипЗнч(ОбъектДоп) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда 
		ОбъектДоп = ПолучитьГоловноеПодразделение(ОбъектДоп);
	КонецЕсли;	
	
	ТаблицаДопРеквизитов = ОбъектДоп.ДополнительныеРеквизиты.Выгрузить();
	Отбор = Новый Структура;
	Отбор.Вставить("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ХарактеристикаТекст,Истина));
	НайденныеСтроки = ТаблицаДопРеквизитов.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество()>0 Тогда 
		Возврат НайденныеСтроки[0].Значение;
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьГоловноеПодразделение(Подразделение)
	
	Если ЗначениеЗаполнено(Подразделение.Родитель) Тогда  
		
		ТаблицаДопРеквизитов = Подразделение.ДополнительныеРеквизиты.Выгрузить();
		Отбор = Новый Структура;
		Отбор.Вставить("Свойство",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Выводить подписанта (Подразделения)",Истина));
		НайденныеСтроки = ТаблицаДопРеквизитов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество()>0 Тогда 
			Зн = НайденныеСтроки[0].Значение;
			Если Зн Тогда //выводить подписанта
				Возврат Подразделение;
			КонецЕсли;	
		КонецЕсли;
		
		Подразд = ПолучитьГоловноеПодразделение(Подразделение.Родитель);
		Возврат Подразд;
	Иначе 
		Возврат Подразделение;	
	КонецЕсли;	
	
	
КонецФункции	


&НаСервере
Функция ПросклонятьДолжность(Представление,Падеж)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление,Падеж);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
	
КонецФункции

Функция ПросклонятьПредставлениеВРодительномПадеже(Представление,ЭтоФИО,Пол,ВыдаватьСообщения=Ложь)
	ПараметрыСк = Новый Структура("ЭтоФИО,Пол");
	
	ПараметрыСк.ЭтоФИО = ЭтоФИО;
	ПараметрыСк.Пол = Пол;
	
	
	СтруктураСклонения = СклонениеПредставленийОбъектов.ДанныеСклонения(Представление,ПараметрыСк, ВыдаватьСообщения);   //fort
	Результат="";
	//СтруктураСклонения = СклонениеПредставленийОбъектов.ДанныеСклонения(Представление, ЭтоФИО, Пол, ВыдаватьСообщения);
	Попытка 
		Если СтруктураСклонения.Свойство("Родительный") Тогда    //fort
			Результат = СтруктураСклонения.Родительный;    //fort
			
		Иначе
			Результат = "";
		КонецЕсли;
	Исключение
		Если ЭтоФИО Тогда 
			ФизическиеЛицаЗарплатаКадры.Просклонять(Представление,2,Результат,Пол); 
		Иначе 
			Возврат Представление;	 
		КонецЕсли;
		
	КонецПопытки;
	Возврат Результат;
	
КонецФункции


Функция ПолучитьОтветственныеЛицаОрганизации();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОбОтветственныхЛицахСрезПоследних.Руководитель.Пол,
	|	СведенияОбОтветственныхЛицахСрезПоследних.Руководитель.Наименование
	|ИЗ
	|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних(&Дата, ) КАК СведенияОбОтветственныхЛицахСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураСведенийОбОтветственных = Новый Структура;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		СтруктураСведенийОбОтветственных.Вставить("РуководительПол",ВыборкаДетальныеЗаписи.РуководительПол);
		СтруктураСведенийОбОтветственных.Вставить("РуководительНаименование",ВыборкаДетальныеЗаписи.РуководительНаименование);
	КонецЕсли;
	
	Возврат СтруктураСведенийОбОтветственных;
	
КонецФункции

Функция  ПолучитьПолФизЛицаПеречисление(Пол)
	
	Если Пол = "Мужской" Тогда 
		Результат = Перечисления.ПолФизическогоЛица.Мужской;
	ИначеЕсли Пол = "Женский" Тогда
		Результат = Перечисления.ПолФизическогоЛица.Женский;
	КонецЕсли;	
	
	Возврат Результат
КонецФункции

Функция ПолучитьМесяц(ИспСрок)
	
	Если ИспСрок = 1 Тогда
		Возврат "месяц";
	ИначеЕсли ИспСрок > 1 И ИспСрок < 5 Тогда
		Возврат "месяца";
	Иначе	//Если ИспСрок >= 5 Тогда
		Возврат "месяцев";
	КонецЕсли; 
	
	
КонецФункции // ()



&НаКлиенте
Процедура Печать1(Команда)
	ТекущиеДанные=Элементы.ТаблицаПодписантов.ТекущиеДанные;
	ОтветсвенноеЛицо=ТекущиеДанные.ОтветсвенноеЛицо;
	Должность=ТекущиеДанные.Должность;
	ОснованиеПраваПодписи=ТекущиеДанные.ОснованиеПраваПодписи;
	ОснованиеПраваПодписиВРодПадеже=ТекущиеДанные.ОснованиеПраваПодписиВРодПадеже;
	Печать("MRS_Печать");
КонецПроцедуры

//<<Загребалов И., Апрель-Софт, 25.03.2022.SD63742
&НаСервере
Функция СформироватьПечатнуюФорму(ДвоичныеДанныеМакетов, ТипМакета, ДанныеОбъекта, ИмяМакета, Области)
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета],ТипМакета);
	ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(ТипМакета, ,Макет);
	// Здесь должен быть код получения областей из макета,
	// их вывода и заполнения в печатной форме.
	Если ПечатнаяФорма <> Неопределено И Макет <> Неопределено Тогда
		
		//// Вывод колонтитулов документа.
		//Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ВерхнийКолонтитул"]);
		//УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта);
		//Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["НижнийКолонтитул"]);
		//УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта);
		//
		//
		// Вывод верхней части документа - обычная область с параметрами.
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь); 	
		
		// Дрожанов
		Если ДанныеОбъекта.НаименованиеОрганизации = "ООО «МРИЯ»" Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ТаблицаГарант"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		ИначеЕсли ДанныеОбъекта.НаименованиеОрганизации = "ООО «МРИЯ.ГАСТРО»" Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ТаблицаКипарис"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			// Быкодаров 09.10.24 HELP1C-9226
		ИначеЕсли ДанныеОбъекта.НаименованиеОрганизации = "ООО ""МРИЯ.ТЕРРУАР""" Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ТаблицаТЕРРУАР"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			//Быкодаров 
			// Быкодаров 20.11.24 добавление РУСЬ
		ИначеЕсли ДанныеОбъекта.НаименованиеОрганизации = "ООО ""РУСЬ""" Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ТаблицаРУСЬ"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			//Быкодаров
			
		ИначеЕсли СтрНайти(ДанныеОбъекта.НаименованиеОрганизации, "ОРБИТА") > 0 Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ТаблицаОРБИТА"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			//КОИ 02.09.2025
			
		ИначеЕсли ДанныеОбъекта.НаименованиеОрганизации = "ООО «МРИЯ.ДЕВЕЛОПМЕНТ»" Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ТаблицаДЕВЕЛОПМЕНТ"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
		ИначеЕсли ДанныеОбъекта.НаименованиеОрганизации = "ООО ""МРИЯ.ПРО"""  Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ТаблицаГоризонт"]);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		КонецЕсли;
		// Дрожанов
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Подвал"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
		
		Возврат АдресХранилищаПечатнойФормы;
		
	Иначе
		
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
//>>