&После("ОбработкаПроведения")
Процедура КГМ_ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр КГМ_Прослеживаемость
	Движения.алкАкцизПоПриобретеннымЦенностям.Записывать = Истина;
	
	//Если СокрЛП(Год(Дата))="2 021" Тогда 
	//	Коэф=0.031;  
	//Иначе 
		Коэф =0.032; 
	//КонецЕсли;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл   
		
		Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры=Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Готовая алкогольная продукция") Тогда
		
		// Расход ====================================================================================================================
		Движение = Движения.алкАкцизПоПриобретеннымЦенностям.Добавить();  
		
		Движение.Активность=Истина;
		Движение.Период			= Дата; 
		Движение.Организация	= Организация; 
		Движение.ДоговорКонтрагента=Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию("Договор поставки №115 от 22.09.2021 г. на поставку винограда");
		Движение.Сделка=Документы.ПриобретениеТоваровУслуг.НайтиПоРеквизиту("НомерВходящегоДокумента","0000-00810").Ссылка;   
			
		// Измерения 
		Движение.СерияНоменклатуры	= Справочники.СерииНоменклатуры.НайтиПоРеквизиту("Номер","00000414") ;    
		Движение.Номенклатура=Справочники.Номенклатура.НайтиПоНаименованию("Виноград в составе");  
		Движение.Продукция=ТекСтрокаТовары.Номенклатура;
		Движение.СерияПродукции=ТекСтрокаТовары.Серия;


		Движение.СостояниеСырья		= Перечисления.алкСостоянияПодакцизногоСырья.ВГотовойПродукции;
		Движение.СтатусАкциза		= Перечисления.алкСостоянияОплатыВходящегоАкциза.АкцизПоОплаченнымМЦ;
		
		Движение.Количество		= (ТекСтрокаТовары.Количество*0.75)*1.34048257413; 
		Движение.КоличествоПродукции=ТекСтрокаТовары.Количество;  
		Движение.ОбщееКоличествоПродукции=ТекСтрокаТовары.Количество;
		
		//Движение.Стоимость		= 0;
		Движение.СуммаАкциза	= Коэф*(ТекСтрокаТовары.Количество*0.75)*1.34048257413;  
		Движение.КБК=Справочники.алкКодыБюджетнойКлассификации2005.НайтиПоКоду("18210302091011000110");
		Движение.СуммаПлатежа=20*(ТекСтрокаТовары.Количество*0.75)*1.34048257413;		

		
		КонецЕсли;
		
		// Реквизиты
	КонецЦикла;
	
КонецПроцедуры


	

