&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// << Александрова Закомментировала 17.01.2022
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	питРецептура.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.питРецептура КАК питРецептура ";
	////
	////|ГДЕ                                      
	////|	питРецептура.Номер = ""К2ER-001310"" 
	//
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда 
	//	
	//	Результат = РезультатЗапроса.Выбрать();
	//	
	//	Результат.Следующий();
	//	
	//	Рецептура = Результат.Ссылка;
	//	
	//КонецЕсли;
	//
	Количество = 1;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ВыключитьВидимостьИнгридиенты", 0.01, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВидимостьИнгридиенты()
	
	Элементы.Ингредиенты.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)

	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаИнгредиенты;
	
	Элементы.Ингредиенты.Видимость = Истина;
	Ингредиенты.Очистить();   
	
	ЗаполнитьИнгредиенты();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)

	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНастройки;
	
	Элементы.Ингредиенты.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнгредиенты()
	
	Номенклатура = Рецептура.Номенклатура;
	//<<03.01.2022 Александрова в запрос добавила   ВесНормы, НормаНаКоличество и ВесНаКоличество
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	питРецептураИнгредиенты.Номенклатура КАК Ингредиент,
	|	питРецептураИнгредиенты.Номенклатура.ЕдиницаДляОтчетов КАК НоменклатураЕдиницаДляОтчетов,
	|	питРецептураИнгредиенты.Характеристика КАК Характеристика,
	|	питРецептураИнгредиенты.Номенклатура.ВесЧислитель КАК Числитель,
	|	питРецептураИнгредиенты.Рецептура КАК Рецептура,
	|	питРецептураИнгредиенты.КоличествоУпаковокБрутто КАК Брутто,
	|	питРецептураИнгредиенты.КоличествоУпаковокБрутто КАК Норма,
	|	питРецептураИнгредиенты.КоличествоУпаковокБрутто * питРецептураИнгредиенты.Номенклатура.ВесЧислитель КАК ВесНормы,
	|	питРецептураИнгредиенты.КоличествоУпаковокБрутто  * &Количество КАК НормаНаКоличество,
	|	питРецептураИнгредиенты.КоличествоУпаковокБрутто * питРецептураИнгредиенты.Номенклатура.ВесЧислитель *  &Количество  КАК ВесНаКоличество
	|ИЗ
	|	Документ.питРецептура.Ингредиенты КАК питРецептураИнгредиенты
	|ГДЕ
	|	питРецептураИнгредиенты.Ссылка = &Рецептура";
	
	Запрос.УстановитьПараметр("Рецептура", Рецептура);
	Запрос.УстановитьПараметр("Количество", Количество);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Результат = РезультатЗапроса.Выгрузить();
	Ингредиенты.Загрузить(Результат);
	//НормаИтого = Ингредиенты.Итог("Норма");
	ВесНормыИтого = Ингредиенты.Итог("ВесНормы");
	//НормаНаКоличествоИтого = Ингредиенты.Итог("НормаНаКоличество");
	ВесНаКоличествоИтого = Ингредиенты.Итог("ВесНаКоличество");
	
	Элементы.ИнгредиентыНорма.ЦветТекстаПодвала = Новый Цвет;
	//>>Александрова 
	Элементы.ИнгредиентыВесНормы.Доступность = Ложь;
	Элементы.ИнгредиентыВесНаКоличество.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИнгредиентыНормаПриИзменении(Элемент)
	
	Элементы.Ингредиенты.ТекущиеДанные.НормаНаКоличество = Элементы.ингредиенты.ТекущиеДанные.Норма * Количество; 
	Элементы.Ингредиенты.ТекущиеДанные.ВесНормы = Элементы.ингредиенты.ТекущиеДанные.Норма * Элементы.ингредиенты.ТекущиеДанные.Числитель; 
	Элементы.Ингредиенты.ТекущиеДанные.ВесНаКоличество = Элементы.ингредиенты.ТекущиеДанные.Норма * Элементы.ингредиенты.ТекущиеДанные.Числитель * Количество; 
	
	НормаИтого  = Ингредиенты.Итог("Норма");
	БруттоИтого = Ингредиенты.Итог("Брутто");
	ВесНормыИтого = Ингредиенты.Итог("ВесНормы");
	НормаНаКоличествоИтого = Ингредиенты.Итог("НормаНаКоличество");
	ВесНаКоличествоИтого = Ингредиенты.Итог("ВесНаКоличество");
	Если НормаИтого = БруттоИтого Тогда 
		ЦветТекстаПодвала = Новый Цвет;
	Иначе                       
		ЦветТекстаПодвала = ПолучитьЦветаСтиляОсобогоТекста();
	КонецЕсли;
	
	Элементы.ИнгредиентыВесНормы.ЦветТекстаПодвала = ЦветТекстаПодвала;	
	Элементы.ИнгредиентыВесНаКоличество.ЦветТекстаПодвала = ЦветТекстаПодвала;

КонецПроцедуры

&НаСервереБезконтекста
Функция ПолучитьЦветаСтиляОсобогоТекста()
	
	Возврат ЦветаСтиля.ЦветОсобогоТекста;
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)

	Результат = Новый Массив;
	
	Для Каждого Строка Из Ингредиенты Цикл 
		
		НоваяСтрока = Новый Структура("Номенклатура, Рецептура, Количество");
		
		НоваяСтрока.Номенклатура 	= Строка.Ингредиент;
		НоваяСтрока.Рецептура    	= Строка.Рецептура;
		НоваяСтрока.Количество 		= Количество * Строка.Норма;
		
		Результат.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	ОповеститьОВыборе(Результат);

КонецПроцедуры

&НаКлиенте
Процедура ИнгредиентыНормаНаКоличествоПриИзменении(Элемент)
	
	Элементы.Ингредиенты.ТекущиеДанные.Норма = Элементы.ингредиенты.ТекущиеДанные.НормаНаКоличество / Количество; 
	Элементы.Ингредиенты.ТекущиеДанные.ВесНормы = Элементы.ингредиенты.ТекущиеДанные.Норма * Элементы.ингредиенты.ТекущиеДанные.Числитель; 
	Элементы.Ингредиенты.ТекущиеДанные.ВесНаКоличество = Элементы.ингредиенты.ТекущиеДанные.Норма * Элементы.ингредиенты.ТекущиеДанные.Числитель * Количество; 

	
	НормаИтого  = Ингредиенты.Итог("Норма");
	БруттоИтого = Ингредиенты.Итог("Брутто");
	ВесНормыИтого = Ингредиенты.Итог("ВесНормы");
	НормаНаКоличествоИтого = Ингредиенты.Итог("НормаНаКоличество");
	ВесНаКоличествоИтого = Ингредиенты.Итог("ВесНаКоличество");
	
	Если НормаИтого = БруттоИтого Тогда 
		ЦветТекстаПодвала = Новый Цвет;
	Иначе
		ЦветТекстаПодвала = ПолучитьЦветаСтиляОсобогоТекста();
	КонецЕсли;
	
	Элементы.ИнгредиентыВесНормы.ЦветТекстаПодвала = ЦветТекстаПодвала;	
	Элементы.ИнгредиентыВесНаКоличество.ЦветТекстаПодвала = ЦветТекстаПодвала;
	
	
	
КонецПроцедуры




