#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
    ПараметрыРегистрации.Версия = "1.0"; 
    ПараметрыРегистрации.Наименование = "Контроль минусовых остатков (mrs)";
    ПараметрыРегистрации.БезопасныйРежим = Ложь; 
    ПараметрыРегистрации.Информация = 
        "Дополнительный отчет: Контроль минусовых остатков (mrs)";
    
    ПараметрыРегистрации.Команды = ПолучитьТаблицуКоманд();
    ДобавитьКоманду(ПараметрыРегистрации.Команды,
        "Контроль минусовых остатков (mrs)",
        "Контроль минусовых остатков (mrs)",
        ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы(),
        Истина);
    Возврат ПараметрыРегистрации;
КонецФункции 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуКоманд()
    Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
    Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
  
	  Параметр = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ДатаОстатков");
	  ДатаОстатков = Параметр.Значение;
	  Параметр.Значение = КонецДня(ДатаОстатков) + 1;
	  Параметр.Использование = Истина;
	  
	  Параметр = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ДатаОстатковСтоимость");
	  ДатаОстатковСтоимость = КонецДня(ДатаОстатков);
	  Параметр.Значение = ДатаОстатковСтоимость;
	  Параметр.Использование = Истина;
	  
	  Параметр = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("НачалоОборотов");
	  пЗначение = НачалоМесяца(ДатаОстатков);
	  Параметр.Значение = пЗначение;
	  Параметр.Использование = Истина;
	  
	  Параметр = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ДатаИнвентаризации");
	  ДатаИнвентаризации = Параметр.Значение;
	  Параметр.Значение = КонецДня(ДатаИнвентаризации) + 1;
	  Параметр.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти