// Модуль формы элемента справочника

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Управляет видимостью и доступностью элементов формы.
&НаКлиенте
Процедура УправлениеДиалогом()
	ДоступностьПоОстаткам   					= СпособЗаполнения = 0;
	ДоступностьПоПоставщику 					= СпособЗаполнения = 1;
	ДоступностьПоПрайсЛисту						= СпособЗаполнения = 3;
	Элементы.Дата.Доступность  			= ДоступностьПоОстаткам;
	Элементы.Склад.Доступность				= ДоступностьПоОстаткам;
	Элементы.Организация.Доступность		= ДоступностьПоОстаткам;
	Элементы.Поставщик.Доступность 		= ДоступностьПоПоставщику;
	Элементы.ВидПрайсЛиста.Доступность 	= ДоступностьПоПрайсЛисту;
КонецПроцедуры // УправлениеДиалогом()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ

&НаКлиенте
Процедура ПереключательПоОстаткамПриИзменении(Элемент)
	УправлениеДиалогом();
КонецПроцедуры // ПереключательПоОстаткамПриИзменении()

&НаСервере
Функция ЗаполнитьСервер()
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Склад",Склад);
	ПараметрыЗаполнения.Вставить("Организация",Организация);
	ПараметрыЗаполнения.Вставить("Дата",Дата);
	ПараметрыЗаполнения.Вставить("Поставщик",Поставщик);
	ПараметрыЗаполнения.Вставить("ВидПрайсЛиста",ВидПрайсЛиста);
	ПараметрыЗаполнения.Вставить("ГруппаНоменклатуры",ГруппаНоменклатуры);
	
	НачатьТранзакцию();
	Если НЕ Справочники.питМеню.ПроверитьКорректностьПередЗаполнением(Владелец,СпособЗаполнения,ПараметрыЗаполнения,СоздаватьГруппы,ФлажокОчищать,ТекущийРодитель) Тогда
		Возврат Ложь;
	КонецЕсли;
	Попытка
		Если ФлажокОчищать Тогда
			РезультатОчистки = Справочники.питМеню.ОчиститьПрайсЛист(Владелец);
			Если НЕ РезультатОчистки Тогда
				ОтменитьТранзакцию();
				Возврат ЛОжь;
			КонецЕсли; 
		КонецЕсли;
		
		Справочники.питМеню.ЗаполнитьПрайсЛист(Владелец,СпособЗаполнения,ПараметрыЗаполнения,СоздаватьГруппы,ФлажокОчищать,ТекущийРодитель);
	Исключение
		СтруктураОшибки = Новый Структура("Заголовок,Текст,Статус","Заполнение меню """+Владелец+""":",ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	Возврат Истина;
КонецФункции // ОсновныеДействияФормыЗаполнить()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, "Непосредственное открытие для данного объекта запрещено!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Владелец) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено,"Владелец не выбран!");
		Возврат;
	КонецЕсли;
	ФлажокОчищать = Истина;
	
	// Установим видимость и значение переключателей учета.
	СпособЗаполнения = 0;
	СоздаватьГруппы = 0;
	УправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ФлажокОчищать Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), "Текущее меню """+ Строка(Владелец) +""" будет очищено. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФрагмент()
	
	Если ЗаполнитьСервер() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	питИзменениеОтраслевыхФормСервер.ПриСозданииНаСервереВНачале(ЭтаФорма, Отказ, СтандартнаяОбработка);
	Если Параметры.Свойство("Владелец") Тогда
	
		Владелец = Параметры.Владелец;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
