Функция Запрос() 
Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаORACLE.ДатаЗакрытияЧека КАК ДатаЗакрытияЧека,
	               |	ТаблицаORACLE.ДатаОткрытияЧека КАК ДатаОткрытияЧека,
	               |	ТаблицаORACLE.ДатаГруппировка КАК ДатаГруппировка,
	               |	ТаблицаORACLE.КОДТОВАРА КАК КОДТОВАРА,
	               |	ТаблицаORACLE.КОДТОВАРАЧИСЛОМ КАК КОДТОВАРАЧИСЛОМ,
	               |	ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА КАК КОЛИЧЕСТВОТОВАРА,
	               |	ТаблицаORACLE.НАЗВАНИЕТОВАРА КАК НАЗВАНИЕТОВАРА,
	               |	ТаблицаORACLE.НАИМЕНОВАНИЕТОЧКИПРОДАЖ КАК НАИМЕНОВАНИЕТОЧКИПРОДАЖ,
	               |	ТаблицаORACLE.НОМЕРТОЧКИПРОДАЖ КАК НОМЕРТОЧКИПРОДАЖ,
	               |	ТаблицаORACLE.НОМЕРЧЕКА КАК НОМЕРЧЕКА,
	               |	ТаблицаORACLE.СУММАСКИДКИЧЕКА КАК СУММАСКИДКИЧЕКА,
	               |	ТаблицаORACLE.СУММАСКИДКИСТРОКИ КАК СУММАСКИДКИСТРОКИ,
	               |	ТаблицаORACLE.СУММАТОВАРА КАК СУММАТОВАРА,
	               |	ТаблицаORACLE.СТОИМОСТЬЧЕКА КАК СТОИМОСТЬЧЕКА,
	               |	ТаблицаORACLE.ЦЕНАТОВАРА КАК ЦЕНАТОВАРА,
	               |	ТаблицаORACLE.КодСтавкиНДС КАК КодСтавкиНДС,
	               |	ТаблицаORACLE.СтавкаНДССтрокой КАК СтавкаНДССтрокой,
	               |	ТаблицаORACLE.НАИМЕНОВАНИЕСКИДКИЧЕКА КАК НАИМЕНОВАНИЕСКИДКИЧЕКА,
	               |	ТаблицаORACLE.НОМЕРМЕТОДАОПЛАТЫ КАК НОМЕРМЕТОДАОПЛАТЫ,
	               |	ТаблицаORACLE.НОМЕРКАССЫ КАК НОМЕРКАССЫ,
	               |	ТаблицаORACLE.НомерПозицииВЧеке КАК НомерПозицииВЧеке,
	               |	ТаблицаORACLE.ИДЧека КАК ИДЧека
	               |ПОМЕСТИТЬ ТаблицаORACLE
	               |ИЗ
	               |	&ТаблицаORACLE КАК ТаблицаORACLE
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаORACLE.ДатаЗакрытияЧека КАК ДатаЗакрытияЧека,
	               |	ТаблицаORACLE.ДатаОткрытияЧека КАК ДатаОткрытияЧека,
	               |	ТаблицаORACLE.ДатаГруппировка КАК ДатаГруппировка,
	               |	ТаблицаORACLE.КОДТОВАРА КАК КОДТОВАРА,
	               |	ТаблицаORACLE.КОДТОВАРАЧИСЛОМ КАК КОДТОВАРАЧИСЛОМ,
	               |	ВЫБОР
	               |		КОГДА НоменклатураСоответствие.Объект ЕСТЬ NULL
	               |			ТОГДА ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НоменклатураСоответствие.Количество * ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА = 0
	               |					ТОГДА ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА
	               |				ИНАЧЕ НоменклатураСоответствие.Количество * ТаблицаORACLE.КОЛИЧЕСТВОТОВАРА
	               |			КОНЕЦ
	               |	КОНЕЦ КАК КОЛИЧЕСТВОТОВАРА,
	               |	ТаблицаORACLE.НАЗВАНИЕТОВАРА КАК НАЗВАНИЕТОВАРА,
	               |	ТаблицаORACLE.НАИМЕНОВАНИЕТОЧКИПРОДАЖ КАК НАИМЕНОВАНИЕТОЧКИПРОДАЖ,
	               |	ТаблицаORACLE.НОМЕРТОЧКИПРОДАЖ КАК НОМЕРТОЧКИПРОДАЖ,
	               |	ТаблицаORACLE.НОМЕРЧЕКА КАК НОМЕРЧЕКА,
	               |	ТаблицаORACLE.СУММАСКИДКИЧЕКА КАК СУММАСКИДКИЧЕКА,
	               |	ТаблицаORACLE.СУММАСКИДКИСТРОКИ КАК СУММАСКИДКИСТРОКИ,
	               |	ТаблицаORACLE.СУММАТОВАРА КАК СУММАТОВАРА,
	               |	ТаблицаORACLE.СТОИМОСТЬЧЕКА КАК СТОИМОСТЬЧЕКА,
	               |	ТаблицаORACLE.ЦЕНАТОВАРА КАК ЦЕНАТОВАРА,
	               |	ТаблицаORACLE.КодСтавкиНДС КАК КодСтавкиНДС,
	               |	ТаблицаORACLE.СтавкаНДССтрокой КАК СтавкаНДССтрокой,
	               |	ТаблицаORACLE.НАИМЕНОВАНИЕСКИДКИЧЕКА КАК НАИМЕНОВАНИЕСКИДКИЧЕКА,
	               |	ТаблицаORACLE.НОМЕРМЕТОДАОПЛАТЫ КАК НОМЕРМЕТОДАОПЛАТЫ,
	               |	ТаблицаORACLE.НОМЕРКАССЫ КАК НОМЕРКАССЫ,
	               |	ТаблицаORACLE.НомерПозицииВЧеке КАК НомерПозицииВЧеке,
	               |	Кассы.ФронтСистема КАК ФронтСистема,
	               |	ЕСТЬNULL(Кассы.Объект, ЗНАЧЕНИЕ(Справочник.КассыККМ.ПустаяСсылка)) КАК КассаККМ,
	               |	ЕСТЬNULL(Кассы.Объект.Владелец, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	               |	ЕСТЬNULL(Кассы.Объект.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	               |	ЕСТЬNULL(Кассы.Объект.Подразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК Подразделение,
	               |	ВЫБОР
	               |		КОГДА питМеню.Номенклатура ЕСТЬ NULL
	               |			ТОГДА ВЫБОР
	               |					КОГДА НЕ НоменклатураСоответствие.НоменклатураАлкоголь = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |						ТОГДА НоменклатураСоответствие.НоменклатураАлкоголь
	               |					ИНАЧЕ НоменклатураСоответствие.Объект
	               |				КОНЕЦ
	               |		ИНАЧЕ питМеню.Номенклатура
	               |	КОНЕЦ КАК Номенклатура,
	               |	ЕСТЬNULL(Кассы.Объект.питКассовыйУзел, ЗНАЧЕНИЕ(ПланОбмена.питУдаленныеКассы.ПустаяСсылка)) КАК КассовыйУзел,
	               |	ВЫРАЗИТЬ(НоменклатураСоответствие.Объект КАК Справочник.Номенклатура).питПродажаПоСвободнойЦене КАК ПродажаПоСвободнойЦене,
	               |	ВЫРАЗИТЬ(НоменклатураСоответствие.Объект КАК Справочник.Номенклатура).ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры) КАК ИспользованиеХарактеристик,
	               |	ЕСТЬNULL(НоменклатураСоответствие.НеВлияетНаУчетТМЦ, ЛОЖЬ) КАК НеВлияетНаУчетТМЦ,
	               |	питВидыОплатОрганизаций.Ссылка КАК МетодОплаты,
	               |	ТаблицаORACLE.ИДЧека КАК ИДЧека
	               |ИЗ
	               |	ТаблицаORACLE КАК ТаблицаORACLE
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК Кассы
	               |		ПО (ПОДСТРОКА(ТаблицаORACLE.НОМЕРТОЧКИПРОДАЖ, 1, 20) = ПОДСТРОКА(Кассы.Код, 1, 20))
	               |			И (Кассы.ФронтСистема = &ФронтСистема)
	               |			И (Кассы.ТипОбъекта = &ТипОбъектаКасса)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК НоменклатураСоответствие
	               |		ПО (ПОДСТРОКА(ТаблицаORACLE.КОДТОВАРА, 1, 20) = ПОДСТРОКА(НоменклатураСоответствие.Код, 1, 20))
	               |			И (НоменклатураСоответствие.ФронтСистема = &ФронтСистема)
	               |			И (НоменклатураСоответствие.ТипОбъекта = &ТипОбъектаНоменклатура)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.MRS_МетодыОплатФронтСистем КАК MRS_МетодыОплатФронтСистем
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.питВидыОплатОрганизаций КАК питВидыОплатОрганизаций
	               |			ПО MRS_МетодыОплатФронтСистем.ТипОплаты = питВидыОплатОрганизаций.ТипОплаты
	               |		ПО ТаблицаORACLE.НОМЕРМЕТОДАОПЛАТЫ = MRS_МетодыОплатФронтСистем.НомерМетодаОплаты
	               |			И (MRS_МетодыОплатФронтСистем.ФронтСистема = &ФронтСистема)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.питМеню КАК питМеню
	               |		ПО ТаблицаORACLE.КОДТОВАРАЧИСЛОМ = питМеню.MRS_КодSimphony";
	
	// Установка параметров.
	ТипОбъектаКасса = ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.КассаККМ; 
	ТипОбъектаНоменклатура = ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.Номенклатура; 
	Запрос.УстановитьПараметр("ТипОбъектаКасса", ТипОбъектаКасса);
	Запрос.УстановитьПараметр("ТипОбъектаНоменклатура", ТипОбъектаНоменклатура);
   	Запрос.УстановитьПараметр("ФронтСистема", ПараметрыВыборки.ФронтСистема);
	Запрос.УстановитьПараметр("ТаблицаORACLE", ТаблицаЗначенийORACLE);
	
	ТаблицаЗначенийORACLE = Запрос.Выполнить().Выгрузить();
	
	ТаблицаЗначенийORACLE.Сортировать("НОМЕРЧЕКА, НомерПозицииВЧеке");

	Возврат ТаблицаЗначенийORACLE;
	
КонецФункции

Функция ЗапросОстатки()
Запрос = Новый Запрос;

Запрос.Текст =
"ВЫБРАТЬ
|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
|	ТоварыНаСкладахОстатки.Склад КАК Склад,
|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки";
РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл
	// Код
КонецЦикла;
Возврат Выборка;
КонецФункции