
&После("ОбработкаПроведения")
Процедура КГМ_ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр КГМ_Прослеживаемость
	Движения.КГМ_Прослеживаемость.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		// Расход ====================================================================================================================
		Движение = Движения.КГМ_Прослеживаемость.Добавить();
		
		Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
		Движение.Период			= Дата;
		
		// Измерения 
		Движение.Номенклатура	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия			= ТекСтрокаТовары.Серия;
		Движение.Склад			= ТекСтрокаТовары.Склад;
		Движение.Подразделение	= Подразделение;
		
		// Ресурсы
		Движение.Количество		= ТекСтрокаТовары.Количество;
		Движение.Стоимость		= 0;
		Движение.Акциз			= 0;
		
		// Реквизиты
		Движение.КорНоменклатура	= ТекСтрокаТовары.Номенклатура;
		Движение.КорПартия			= ТекСтрокаТовары.Серия;
		Движение.КорСклад			= ТекСтрокаТовары.Склад;
		Движение.КорПодразделение	= Подразделение;
		Движение.Контрагент			= Контрагент;
		Движение.СтоимостьОплачено	= 0;
		Движение.КоличествоДоп		= ТекСтрокаТовары.Количество;
		
		Движение.ТехнологическаяОперация		= Справочники.КГМ_ТехнологическиеОперацииВиноделия.РеализацияПокупателям;
		Движение.ВидОперацииДляПрослеживаемости	= Перечисления.ВидыОперацийДляПрослеживаемости.ПоставкаАПОпт;  
		Движение.ГУИДЗаписи = Новый УникальныйИдентификатор();
		
		
		// Приход ==========================================================================================================================
		Движение = Движения.КГМ_Прослеживаемость.Добавить();
		
		Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
		Движение.Период			= Дата;
		
		// Измерения 
		Движение.Номенклатура	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия			= ТекСтрокаТовары.Серия;
		Движение.Склад			= ТекСтрокаТовары.Склад;
		Движение.Подразделение	= Подразделение;
		
		// Ресурсы
		Движение.Количество		= ТекСтрокаТовары.Количество;
		Движение.Стоимость		= 0;
		Движение.Акциз			= ТекСтрокаТовары.алкСуммаАкцизаНачисленного;
//	#Кондрат 30.09.2021 [>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
		Движение.КоличествоРеализации = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Номенклатура.ОбъемДал*10; // в литрах!
//	#Кондрат 30.09.2021 ]<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
		
		// Реквизиты
		Движение.КорНоменклатура	= ТекСтрокаТовары.Номенклатура;
		Движение.КорПартия			= ТекСтрокаТовары.Серия;
		Движение.КорСклад			= ТекСтрокаТовары.Склад;
		Движение.КорПодразделение	= Подразделение;
		Движение.Контрагент			= Контрагент;
		Движение.СтоимостьОплачено	= 0;
		Движение.КоличествоДоп		= ТекСтрокаТовары.Количество;
		
		Движение.ТехнологическаяОперация		= Справочники.КГМ_ТехнологическиеОперацииВиноделия.РеализацияПокупателям;		
		Движение.ВидОперацииДляПрослеживаемости	= Перечисления.ВидыОперацийДляПрослеживаемости.ПоставкаАПОпт;
		Движение.ГУИДЗаписи = Новый УникальныйИдентификатор();
	КонецЦикла;
	
КонецПроцедуры
