
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Устанавливает отбор по дате документа
//
&НаКлиенте
Процедура УстановитьОтбор()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаНач", Период.ДатаНачала, ЗначениеЗаполнено(Период.ДатаНачала));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаКон", Период.ДатаОкончания, ЗначениеЗаполнено(Период.ДатаОкончания));
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ

&НаКлиенте
Процедура Заполнить(Команда)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выделите необходимые строки выпусков продукции";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ПрайсЛистЗаполнен() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки)), " Текущее меню <"+ Владелец +"> будет очищено. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьФрагмент(ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьФрагмент(ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФрагмент(Знач ВыделенныеСтроки)
	
	Перем МассивДокументов, ТекСтрока;
	
	Если НЕ ОчиститьПрайсЛист() Тогда
		Возврат;
	КонецЕсли;
	
	МассивДокументов = Новый Массив;
	Для Каждого ТекСтрока Из ВыделенныеСтроки Цикл
		МассивДокументов.Добавить(Элементы.Список.ДанныеСтроки(ТекСтрока).ссылка);
	КонецЦикла;
	ОповеститьОВыборе(МассивДокументов);
	
КонецПроцедуры

&НаСервере
Функция ПрайсЛистЗаполнен();
	Возврат Справочники.питМеню.ПрайсЛистЗаполнен(Владелец);
КонецФункции


&НаСервере
Функция ОчиститьПрайсЛист();
	РезультатОчистки = Справочники.питМеню.ОчиститьПрайсЛист(Владелец);
	
	Возврат РезультатОчистки;
КонецФункции

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Период.ДатаНачала = НачалоДня(ТекущаяДата());
	Период.ДатаОкончания = КонецДня(ТекущаяДата());
	
	УстановитьОтбор();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	питИзменениеОтраслевыхФормСервер.ПриСозданииНаСервереВНачале(ЭтаФорма, Отказ, СтандартнаяОбработка);
	Если Параметры.Свойство("Владелец") Тогда
	
		Владелец = Параметры.Владелец;
	КонецЕсли;
КонецПроцедуры







////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
