#Область СведенияОВнешнейОбработке

Функция СведенияОВнешнейОбработке() Экспорт
	
	Перем ИмяОбработки, Синоним, Комментарий; 
	ИмяОбработки		= Метаданные().Имя;
	Синоним				= Метаданные().Синоним;
	Комментарий 		= Метаданные().Комментарий;
	
	//Переменные
	ПараметрыРегистрации = Новый Структура;
	                                           
	//Параметры регистрации
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
   //Наименование обработки, которым будет заполнено наименование элемента справочника по умолчанию - краткая строка для идентификации обработки администратором 
	ПараметрыРегистрации.Вставить("Наименование", Синоним);
	ПараметрыРегистрации.Вставить("Версия", "1.1");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
    //Краткая информация по обработке, описание обработки. 
	ПараметрыРегистрации.Вставить("Информация", ?(ЗначениеЗаполнено(Комментарий), Синоним, Комментарий));
    
    //Добавим команды к форме
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); 
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); 
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево")); 
	ТаблицаКоманд.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка")); 
	
	ЗаполнитьЗначенияСвойств(ТаблицаКоманд.Добавить(), 
		Новый Структура("Представление,Идентификатор,Использование", Синоним, ИмяОбработки, "ОткрытиеФормы")); 
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти 
