
//&Перед("ПередЗаписью")
//Процедура ас_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	
//	//>> Голубев А. 2024-12-02 - Агентская схема - для новых документов перебрасываем назначения для тч товары
//	//FIXME: это времянка, без проверок разбивки номенклатуры по строкам
//	//после проверки нормально интегрировать в обработку формирования заказа
//	Если ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если ЭтоНовый() И ЭтоАгентскаяСхема() Тогда
//		
//		Запрос = Новый Запрос("ВЫБРАТЬ
//		                      |	Т.Номенклатура КАК Номенклатура,
//		                      |	Т.Характеристика КАК Характеристика,
//		                      |	Т.Склад КАК Склад,
//		                      |	Т.ПЛ_Заказ КАК ПЛ_Заказ,
//		                      |	Т.Количество КАК Количество
//		                      |ПОМЕСТИТЬ врТаб_Товары
//		                      |ИЗ
//		                      |	&ТаблицаТовары КАК Т
//		                      |ГДЕ
//		                      |	Т.ПЛ_Заказ ССЫЛКА Документ.ЗаказНаПеремещение
//		                      |	И НЕ Т.ПЛ_Заказ = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
//		                      |
//		                      |ИНДЕКСИРОВАТЬ ПО
//		                      |	ПЛ_Заказ,
//		                      |	Номенклатура,
//		                      |	Характеристика
//		                      |;
//		                      |
//		                      |////////////////////////////////////////////////////////////////////////////////
//		                      |ВЫБРАТЬ
//		                      |	т.ПЛ_Заказ КАК ПЛ_Заказ,
//		                      |	т.Номенклатура КАК Номенклатура,
//		                      |	т.Характеристика КАК Характеристика,
//		                      |	СУММА(т.Количество) КАК Количество_ЗаказПоставщику,
//		                      |	СУММА(тт.Количество) КАК Количество_ЗаказНаПеремещение,
//		                      |	МАКСИМУМ(тт.Назначение) КАК Назначение
//		                      |ИЗ
//		                      |	врТаб_Товары КАК т
//		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК тт
//		                      |		ПО (тт.Ссылка = т.ПЛ_Заказ)
//		                      |			И (тт.Номенклатура = т.Номенклатура)
//		                      |			И (тт.Характеристика = т.Характеристика)
//		                      |
//		                      |СГРУППИРОВАТЬ ПО
//		                      |	т.ПЛ_Заказ,
//		                      |	т.Номенклатура,
//		                      |	т.Характеристика");
//		
//		ТаблицаТовары = Товары.Выгрузить(, "Номенклатура, Характеристика, Склад, ПЛ_Заказ, Количество");
//		Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары);
//		
//		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, ПЛ_Заказ");
//		
//		ВыборкаСтрок = Запрос.Выполнить().Выбрать();
//		Пока ВыборкаСтрок.Следующий() Цикл
//			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаСтрок);
//			НайденныеСтроки = Товары.НайтиСтроки(СтруктураПоиска);
//			Для Каждого нСтрока Из НайденныеСтроки Цикл
//				Если ЗначениеЗаполнено(нСтрока.Назначение) Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				нСтрока.Назначение = ВыборкаСтрок.Назначение;
//			КонецЦикла;
//		КонецЦикла;
//	КонецЕсли;
//	//>> Голубев А. 2024-12-02 - Агентская схема
//	
//КонецПроцедуры

////FIXME: ждем ответа как правильно определять Агентскую схему
//Функция ЭтоАгентскаяСхема()
//	
//	РезультатМетода = Ложь;
//	
//	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
//		
//		РеквизитыСкладовОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "ДокументОснование.Договор.ТипДоговора");
//																					//"СкладОтправитель.Наименование,
//																					//|СкладПолучатель.Наименование,
//		
//		Если РеквизитыСкладовОснования.ДокументОснованиеДоговорТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СКомитентомНаЗакупку")
//			//и Лев(РеквизитыСкладовОснования.СкладОтправительНаименование, 3) = "00 "
//			//и Лев(РеквизитыСкладовОснования.СкладПолучательНаименование, 4) = "232 "
//			Тогда
//			
//			РезультатМетода = Истина;
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//		
//	Возврат РезультатМетода;
//	
//КонецФункции
